[
    {
        "comment": "Duo is always two steps ahead!"
    },
    {
        "comment": "the body teaaa tho"
    },
    {
        "comment": "CEO of emotional damage"
    },
    {
        "comment": "He knew the entire time...truly a lingo that is the duo..."
    },
    {
        "comment": "And to think, we JUST mailed a condolences card"
    },
    {
        "comment": "Ok that’s great so when can we deliver you some pastries?"
    },
    {
        "comment": "Owls are really the smartest birds 💯"
    },
    {
        "comment": "Love seeing Duo is a Swiftie 💖 welcome back!!!"
    },
    {
        "comment": "I put the fun in funeral 😭😭😭😭😭"
    },
    {
        "comment": "The bird is always 10 steps ahead"
    },
    {
        "comment": "should've pretended to be dead longer and gotten dua lipa to sing at your funeral 😔"
    },
    {
        "comment": "I can't believe I got roasted by a learning language bird"
    },
    {
        "comment": "duo walked so spotify could run"
    },
    {
        "comment": "I want my family back I’m begging you"
    },
    {
        "comment": "Duo casually roasting me 💀"
    },
    {
        "comment": "We got duo wrapped before Spotify wrapped"
    },
    {
        "comment": "Did you know there's a language called Yapese? It's spoken in Micronesia. I learned a song in the language. At first glance, I thought that's what you were referring to 😃🗣️✍️"
    },
    {
        "comment": "I can’t realize that Duo is gone… 😭 fly high….bird…. that makes sense…. 🕊️"
    },
    {
        "comment": "Thank you duo(can I have my tongue back)"
    },
    {
        "comment": "“At least Duo will listen”\nNOW HE WON’T 😭😭😭"
    },
    {
        "comment": "i fear it might be more"
    },
    {
        "comment": "i made 590 mistakes this year including my ex 😔"
    },
    {
        "comment": "Gone too soon, we lost a real one"
    },
    {
        "comment": "Duo, quick question! What language should I learn next?"
    },
    {
        "comment": "duo why are there more european languages than other more commonly spoken languages on your app?? like some of the worlds most spoken languages like Yoruba, Hausa, Bengali, Urdu, Igbo are not on your app. please change that! we love your app but we want more diversity 🥹💭"
    },
    {
        "comment": "Why not add a Dualipa photo? 😭"
    },
    {
        "comment": "They're all the same picture!"
    },
    {
        "comment": "I had a nightmare last night where there was an army of Duos in the sky moving slowly like hot air balloons. What does it mean y’all?"
    },
    {
        "comment": "iconic because your ceo also invented reCAPTCHA"
    },
    {
        "comment": "This is all fake. You were in my heart all along"
    },
    {
        "comment": "Loved the first one🔥"
    },
    {
        "comment": "You forgot to include the picture of you on my grill"
    },
    {
        "comment": "I need to know who took these pics they’re amazing"
    },
    {
        "comment": "these hit different"
    },
    {
        "comment": "“Plankton Duo isn’t real; he can’t hurt you”"
    },
    {
        "comment": "Duo is Alive , idk if it’s a good thing"
    },
    {
        "comment": "Who's managing this account? 😭"
    },
    {
        "comment": "Lily love....you good?"
    },
    {
        "comment": "The beak is unsettling…"
    },
    {
        "comment": "Lily we are here if you need us..."
    },
    {
        "comment": "Chat is Plankton ok?"
    },
    {
        "comment": "duo be tired of her"
    },
    {
        "comment": "One minute ago is crazy 😭 also duo are you okay"
    },
    {
        "comment": "Lily always makes me feel better"
    },
    {
        "comment": "Don’t do my girl Lily like that 💀"
    },
    {
        "comment": "Lily could get it"
    },
    {
        "comment": "\"Is that doctor four years old\""
    },
    {
        "comment": "\"i threw beans at my brother\" goes hard"
    },
    {
        "comment": "‘Microwaves are watching you’. Duo over here confirming my worst nightmare"
    },
    {
        "comment": "‘Help! The ghost is in the sugar.’ A phrase that has helped me navigate my life in Italy."
    },
    {
        "comment": "\"i do not hear you since i have cinnamon rolls in my ears\" 👍🏿"
    },
    {
        "comment": "\"This powder is not for little children\" and \"Finally, I rest at the bottom of the ocean\" is probably my favorites"
    },
    {
        "comment": "“Dad where is mom?” Is still one of my favourites"
    },
    {
        "comment": "10 seconds is wild 💀"
    },
    {
        "comment": "I once got a lesson when ch said \"who is the person on our bed\" 💀💀"
    },
    {
        "comment": "my favorite is the stories yall come up with like wdym “Junior thinks Eddy is a lion tamer bc he has a whip and leather pants in his closet”"
    },
    {
        "comment": "“I am an apple” NO I’M NOT"
    },
    {
        "comment": "my fav is when lily says \"i love women\" like yeah me too"
    },
    {
        "comment": "at least you’re self aware💀"
    },
    {
        "comment": "Microwaves are watching ME?!?!"
    },
    {
        "comment": "microwaves are watching us"
    },
    {
        "comment": "Your toilet break is HOW long?!"
    },
    {
        "comment": "I think Falstaff and I would’ve gotten along well (I will bring snacks and blankets for the nap times)"
    },
    {
        "comment": "I need to know the tea with Legal Steve"
    },
    {
        "comment": "Lily’s so real LOL"
    },
    {
        "comment": "Lily : call ppl and pretend to listen ‼️‼️‼️"
    },
    {
        "comment": "wait did we actually blackout"
    },
    {
        "comment": "a midday meditation already scheduled?! a bird after our own heart 💘"
    },
    {
        "comment": "i always knew i was lily"
    },
    {
        "comment": "if i was ur bank id let u buy chuck e cheese"
    },
    {
        "comment": "Is the embezzlement meeting open to the public? You know…for professional development reasons 👀"
    },
    {
        "comment": "Well… at least you got a meditation in 🧘"
    },
    {
        "comment": "You embezzling over there, Duo"
    },
    {
        "comment": "I need to see the Rambo death note drawing"
    },
    {
        "comment": "Bro does anything but teach u language"
    },
    {
        "comment": "No hate button --------------------------------------->"
    },
    {
        "comment": "I fear duo ate"
    },
    {
        "comment": "duo who’s ur choreographer"
    },
    {
        "comment": "People after seeing Duolingo has passed away"
    },
    {
        "comment": "DUO ATE THE DANCE FRFR"
    },
    {
        "comment": "I knew this game is gonna be the end of duo"
    },
    {
        "comment": "Can I get out of the basement now?"
    },
    {
        "comment": "Wtf bro?! Duo is a fan of Solo Levelling?!?!"
    },
    {
        "comment": "Is this…. Duo Leveling???"
    },
    {
        "comment": "Duo I will start Korean lessons as long as you add “arise” command to the curriculum"
    },
    {
        "comment": "We learning korean with this one 🔥🔥🗣️🗣️🗣️🗣️"
    },
    {
        "comment": "it's almost poetic, duo \"dying\" and coming back, and being a fan of sung jinwoo 👀"
    },
    {
        "comment": "DUO LINGO AND SOLO LEVELING? THE COLLAB WE DIDNT KNOW WE NEEDED"
    },
    {
        "comment": "The Duolingo crossover multiverse expands once again"
    },
    {
        "comment": "thirst trapping me into learning 😫"
    },
    {
        "comment": "my ears are open"
    },
    {
        "comment": "I support this ❤️"
    },
    {
        "comment": "Gang i think im the main character"
    },
    {
        "comment": "We revived him with our xp 🙌 legends never die"
    },
    {
        "comment": "we might need that care package back"
    },
    {
        "comment": "owl resurrection party at our place! 🎉"
    },
    {
        "comment": "We got a Duo resurrection before GTA6 👀"
    },
    {
        "comment": "Duo baby I never doubted you"
    },
    {
        "comment": "We never doubted your comeback king 💛"
    },
    {
        "comment": "Now we have trust issues…"
    },
    {
        "comment": "Duo I am in tears 😭 please never scare me like that again"
    },
    {
        "comment": "We thought you were Finger Lickin’ Gone 🥹"
    },
    {
        "comment": "Duolingo resurrection was not on my 2025 bingo card."
    },
    {
        "comment": "Do you need a ride to work?"
    },
    {
        "comment": "Sometimes you literally have to pop out and show ‘em"
    },
    {
        "comment": "🇫🇷🇫🇷🇫🇷🇫🇷🇫🇷🇫🇷🇫🇷 MIEL POPS MIAM MIAM MIAM 😋 😋 😋 TROOOOOOP BOOOOOOON 🥣🥣🥣🥣CROUNCH CROUNCH CROUUUUUUUUNCH 🥐🥐🥐🥐🥐🥐SON GOÛT 🤤🤤🤤 SUPER DOUX 😍😍😍😍C'EST MON CALINNNNNNNN 🔥🔥🔥🔥DU MATIIIIIIIIIIIIIIINNNN 💥💥💥💥💥💥💥☀️☀️☀️☀️🕯️🌋🌋🌋🔥🧯♨️🎆🎆 🇫🇷🇫🇷🥣🥣😋😋🥐🥐♨️♨️🧯🧯🎆🔥🎆🔥🌋🕯️☀️💥💥💥💪💪 !!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "comment": "MIEL POPS 🍯🐝 MIAM MIAM MIAM 🤤😍 TROP BON 😋🔥 CROUNCH CROUNCH CROUNCH 🥣✨💥 SON GOÛT SUPER DOUX C'EST MON CÂLIN 🤗💛 DU MATIN 🌞⏰"
    },
    {
        "comment": "WE'VE GOT MIEL POPS DUOLINGO RAVE BEFORE GTA 6😭🇨🇵"
    },
    {
        "comment": "And so, the Duopocalypse begins…"
    },
    {
        "comment": "RAAAAAH FRENCH RÉFÉRENCE🇨🇵🇨🇵🇨🇵⚜️⚜️🥖🥖🥐🥐🥐 QU'EST-CE C'EST QU'UN PUTAIN DE MILES🇨🇵🇨🇵⚜️⚜️🥖🥖🥐🥐🥐"
    },
    {
        "comment": "The Duo multiverse 😭"
    },
    {
        "comment": "MIEL POPS 🍯 MIAM MIAM MIAM TROP BON 😋😋😋🤤"
    },
    {
        "comment": "🇨🇵🇨🇵🇨🇵🟡🟡🟡 MIEL POPS 🟡🟡🟡 MIAM MIAM MIAM 💛 TROOOOOOOP BON 💛💛💛 CROUNCH CROUNCH CROUNCH 💥💥💥 SON GOÛT SUPER DOUX 🎀 C'EST MON CALIN 🥺💛 DU MATIIIIINNNNN 🔆💥💥💥💥💥💥💥🇨🇵🇨🇵🇨🇵🇨🇵"
    },
    {
        "comment": "Me after marking one thing off my to-do list"
    },
    {
        "comment": "is this a cult gathering"
    },
    {
        "comment": "we went from hieroglyphs to letters to emojis, we've come full circle"
    },
    {
        "comment": "Translation:At this juncture, I am merely offering an observation, as I cannot, in good conscience, deceive you. For what purpose I would possess the requisite knowledge to respond with certainty, I do not know. However, I must emphasize the truthfulness of this statement, for one must acknowledge the considerable extent to which this situation is presently unfolding. Might I inquire, esteemed colleague, whether you too perceive the absurdity of our current reality? With utmost sincerity, I confess that your actions, regrettably, incite my profound irritation. Nevertheless, we must proceed, for I swear upon my very being that you are, indeed, complicit. Permit me to express amusement at this state of affairs, for, at present, such circumstances are presently occurring. Be advised that, in all honesty, the reality of the matter cannot be denied, and thus, I respectfully inquire whether we should proceed further in this endeavor."
    },
    {
        "comment": "I'm here too early"
    },
    {
        "comment": "WHAT IS THAT😦✋"
    },
    {
        "comment": "18m ago is kidney touching"
    },
    {
        "comment": "This shit is giving me a brain hemorrhage"
    },
    {
        "comment": "\"Are you seriously for real right now, bro? LOL, at this point, just go. I don’t even know, never mind, I can’t lie, why are you so bothered? So, for real, work with me right now, please, just let me know, okay? Got to go. I can’t lie, you piss me off so much, not gonna lie, LOL, oh my stars, at this point, just go.\" 🙄"
    },
    {
        "comment": "This would vaporize a Victorian child"
    },
    {
        "comment": "Even my great great grand children wouldn'd be able to answer that."
    },
    {
        "comment": "POV: Historians in the year 2333 studying our brainrot"
    },
    {
        "comment": "I’m having an aneurysm right now."
    },
    {
        "comment": "1 minute ago is molestation"
    },
    {
        "comment": "I've never been this early where tf are all the companies"
    },
    {
        "comment": "A+ for the whole semester."
    },
    {
        "comment": "If you needed an escape, you could've just booked a cruise tbh"
    },
    {
        "comment": "welcome back bb"
    },
    {
        "comment": "We were already planning your Día De Muertos altar. 😩"
    },
    {
        "comment": "I’m this level of dramatic"
    },
    {
        "comment": "no longer crying in my mourning suite"
    },
    {
        "comment": "girl whatever"
    },
    {
        "comment": "We never lost hope 💜💚💛❤️"
    },
    {
        "comment": "This is “Verified only” ahh comment section😭🙏"
    },
    {
        "comment": "we can't keep up anymore"
    },
    {
        "comment": "Iconic behavior 🏆"
    },
    {
        "comment": "🚨 False life insurance claim? We've seen it all. Nice try, though 😉"
    },
    {
        "comment": "the edit goes crazy"
    },
    {
        "comment": "Why does this edit go so hard"
    },
    {
        "comment": "this is peak diva behavior"
    },
    {
        "comment": "This is just confirming I’m in a cult and there’s no escape 😭"
    },
    {
        "comment": "is this play about us?"
    },
    {
        "comment": "Duolingo being \"relaxing\" is actually more terrifying than actually terrifying us"
    },
    {
        "comment": "Duolingo team is cooking something and that’s what scares me the most"
    },
    {
        "comment": "are we in a cult now"
    },
    {
        "comment": "😭\"the bird cannot hurt you\""
    },
    {
        "comment": "I was waiting for a jump scare."
    },
    {
        "comment": "NO. I want to learn in fear"
    },
    {
        "comment": "Me waiting for a plot twist very impatiently:"
    },
    {
        "comment": "This is too calm.  I can't learn Spanish without the chicken harassing me."
    },
    {
        "comment": "“you do not have to be afraid of an owl… anymore”"
    },
    {
        "comment": "But what if I want the bird to hurt me?"
    },
    {
        "comment": "I demand threats by my favorite owl!"
    },
    {
        "comment": "I broke my streak and Duo died the next day. I'm responsible for this"
    },
    {
        "comment": "this is possibly the best marketing campaign I've seen in a while"
    },
    {
        "comment": "wtf we got duo’s resurrection before gta 6"
    },
    {
        "comment": "Ngl he’s gonna stay dead we CANNOT do that many lessons"
    },
    {
        "comment": "My six year old is having a really hard time with this marketing campaign."
    },
    {
        "comment": "so is bro dead or not"
    },
    {
        "comment": "Can you twerk for the fans Duo"
    },
    {
        "comment": "I just finished cooking some delicious green chic— oh, wrong post."
    },
    {
        "comment": "I’m salty that you died instead of being my Valentine, so I’m not doing my lessons"
    },
    {
        "comment": "Duo, this is a lot of collective pressure. We love Duo and want to learn a language. We had better receive all the points in the world if he’s revived."
    },
    {
        "comment": "there needs to be a documentary on this 😔"
    },
    {
        "comment": "Duo still haunting us while dead 💀"
    },
    {
        "comment": "If we save him do I get my family back?"
    },
    {
        "comment": "Yeah duo is the best teacher and the only good one in this world🙌"
    },
    {
        "comment": "Google Translation Time for you to shine"
    },
    {
        "comment": "Lily’s photo in the background😂😂"
    },
    {
        "comment": "Why does it look like such a fun place to work?"
    },
    {
        "comment": "that staff should’ve learned CPR instead of 37 languages 😩💔"
    },
    {
        "comment": "What if duo faked his death and did this"
    },
    {
        "comment": "not sure which language to cry in 😭"
    },
    {
        "comment": "At least give me a warning for disturbing footage 😭"
    },
    {
        "comment": "I am so confused by whatever the heck it is Duolingo is trying to do with this storyline"
    },
    {
        "comment": "if duo’s dead… and zari, lily, and falstaff are also dead… then who’s driving the bus 😳"
    },
    {
        "comment": "what the fuck is happening"
    },
    {
        "comment": "Ok but whoever's filming did it"
    },
    {
        "comment": "I have a theory, what if duolingo faked his death"
    },
    {
        "comment": "waitttt this is so sad 😔 are yall hiring?"
    },
    {
        "comment": "Why are they clapping? 💀"
    },
    {
        "comment": "Is this a celebration? Why they clapping 😭"
    },
    {
        "comment": "So fast a content making just how I like it"
    },
    {
        "comment": "Then how is the app still working? 🦉😵"
    },
    {
        "comment": "I NEED TO KNOW WHERE THIS IS GOING"
    },
    {
        "comment": "Why is Pablo Escobar teaching us German"
    },
    {
        "comment": "Rip duo “🦅” ( couldn't find 🕊️ emoji )"
    },
    {
        "comment": "bring the bird back"
    },
    {
        "comment": "we refuse to accept this"
    },
    {
        "comment": "We’re just gonna speak German as if NOTHING HAPPENED?!"
    },
    {
        "comment": "Refuse to learn without the owl 🦉"
    },
    {
        "comment": "Going thru the 5 stages of grief rn 😢"
    },
    {
        "comment": "\"both killed by a cyber truck\" 😭"
    },
    {
        "comment": "Idk dude, I don’t think duo is going to heaven"
    },
    {
        "comment": "Everything Elon touches dies"
    },
    {
        "comment": "Duo is NOT seeing the gates"
    },
    {
        "comment": "I knew it was Melon Husk’s fault."
    },
    {
        "comment": "We all know you didn’t go to heaven, duo"
    },
    {
        "comment": "THIS BETTER NOT BE A CUTE WAY OF TELLING US ELON BOUGHT THE COMPANY ISTG"
    },
    {
        "comment": "@duolingo all lime jarritos poured will be in honor of Duo. 😔"
    },
    {
        "comment": "lots to unpack here"
    },
    {
        "comment": "What a way to go"
    },
    {
        "comment": "we got Elon getting roasted by Duolingo before gta 6"
    },
    {
        "comment": "twitter is NOT going that direction"
    },
    {
        "comment": "On the next episode of Maury…"
    },
    {
        "comment": "Wait I didn't know you were the CEO! Luis!! 👏"
    },
    {
        "comment": "Sending the Duolingo team so much love 😔🙏"
    },
    {
        "comment": "I miss Duo’s threats 😭 please come back so you can lock me in your basement"
    },
    {
        "comment": "I can’t glow on like this. Who else is going to watch me do my streaks and skincare? 😔"
    },
    {
        "comment": "Pouring one out for Duo - gone, but still somehow judging us. 💚💙"
    },
    {
        "comment": "Who got Duo’s life insurance???? 👀"
    },
    {
        "comment": "our hearts are with you duo’s daddy 😭"
    },
    {
        "comment": "Duo’s daddy deserves a trip somewhere to grieve in peace 😢"
    },
    {
        "comment": "this is the most epic corporate story arc"
    },
    {
        "comment": "Hear me out: he will come back from the dead and so will all the other Duolingo bros and they’ll announce rep tv"
    },
    {
        "comment": "fly high duo 💚 im sorry i gave up on my streak 3 years ago"
    },
    {
        "comment": "\"Non-refundable because death is irreversible\" 💀"
    },
    {
        "comment": "They can't afford a funeral they're giving the bodies away"
    },
    {
        "comment": "This company is so unserious 💀"
    },
    {
        "comment": "\"we are monetizing grief because we're a corporation\" 💀💀💀💀💀💀"
    },
    {
        "comment": "ive always wanted dead plushies of my comfort characters!"
    },
    {
        "comment": "Monetizing grief is the best way to help us heal ❤️"
    },
    {
        "comment": "I dont know whats happening"
    },
    {
        "comment": "sure, why not"
    },
    {
        "comment": "“Why process your emotions when you can process a payment” is wild hahahah"
    },
    {
        "comment": "“We’re monetizing grief because we are a corporation! 🥰🥰😍”"
    },
    {
        "comment": "They're gone forever just like Duo"
    },
    {
        "comment": "WHAT KIND OF MARKETING STRATEGY IS THIS PLEASE I AM SO CONFUSED"
    },
    {
        "comment": "i can just imagine the PR meeting with some guy like “what if… we killed everyone”"
    },
    {
        "comment": "If you guys rebrand to not include the characters WE RIOT"
    },
    {
        "comment": "I’d be so sad if duolingo was rebranded so I hope it isn’t that :’)"
    },
    {
        "comment": "Duo the world is stressful enough stop adding to it 😭"
    },
    {
        "comment": "Unsafe workplace. How did a child get close enough to Lily 🤣"
    },
    {
        "comment": "They're dropping like flies😨😨😨"
    },
    {
        "comment": "Why does this keep happening 😭"
    },
    {
        "comment": "First Duo, then Falstaff, then Zari, now Lily?! \"HOO\"s Next?!"
    },
    {
        "comment": "BUT ARE VIKRAM, JUNIOR AND BEA OK? WE NEED TO KNOW!"
    },
    {
        "comment": "Not Lily's worst nightmare coming true: 💀 by affection"
    },
    {
        "comment": "Don’t you dare hurt Lily!!"
    },
    {
        "comment": "I'm cracking up imagining that admin has been given their notice and is doing all this without permission. Crazy work lmao"
    },
    {
        "comment": "Duo does this mean I can go home now??"
    },
    {
        "comment": "Nah, this is becoming boring now."
    },
    {
        "comment": "Not them following thru with all of this😭"
    },
    {
        "comment": "The rumours are true... He forgot to thank Beyonce-"
    },
    {
        "comment": "I can finally skip a lesson"
    },
    {
        "comment": "They died doing what they loved 💔"
    },
    {
        "comment": "who will remind me to do my lessons now 😕"
    },
    {
        "comment": "How am I supposed to focus on my lesson when DUO IS DEAD??"
    },
    {
        "comment": "Fly high, my friend 😭"
    },
    {
        "comment": "trigger warning before the open casket next time 😔"
    },
    {
        "comment": "Can.. Can we eat him ?"
    },
    {
        "comment": "Fly high bestie 😭"
    },
    {
        "comment": "NOT THE SONG CHOICE 😂 but also RIP to my Shayla"
    },
    {
        "comment": "That’s what you get for rejecting my proposal"
    },
    {
        "comment": "If duo was truly dead and I stop my streak he won’t appear correct"
    },
    {
        "comment": "Reminder this whole thing is to distract from the fact they fired their translators to replace them with ai"
    },
    {
        "comment": "duo’s death case was in the radio in denmark today🦅😍"
    },
    {
        "comment": "Sweet moves little fella...RIP duo btw 🙏"
    },
    {
        "comment": "My family is finally free, i thank the driver who crossed him"
    },
    {
        "comment": "I can’t tell if I want or cry or laugh"
    },
    {
        "comment": "don’t worry guys he’s just paying his respect"
    },
    {
        "comment": "I'll miss you yelling at me when i skipped my lesson...🙏🕊😓"
    },
    {
        "comment": "Real question, would Duolingo fit in a burger bun?"
    },
    {
        "comment": "This marketing team is unhinged 😂"
    },
    {
        "comment": "And remember guys duo is making fun of his own death"
    },
    {
        "comment": "Obviously duo wants the Eagles to win. Birds gotta support birds"
    },
    {
        "comment": "coach duo they need you out on the field"
    },
    {
        "comment": "the superb owl"
    },
    {
        "comment": "You're getting too quick with posts"
    },
    {
        "comment": "duo will you be my valentine (LOUDER THAN EVERYONE ELSE)"
    },
    {
        "comment": "so real my king"
    },
    {
        "comment": "How you gonna do Mahomes like that🤣"
    },
    {
        "comment": "Wow you’re fast"
    },
    {
        "comment": "Mahomes needs a map rn"
    },
    {
        "comment": "Isn't duo dead then how he is going to teach us??"
    },
    {
        "comment": "Who else saw the tongue commercial..."
    },
    {
        "comment": "We sent our condolences to you. They were delivered to your neighbor, though."
    },
    {
        "comment": "Safety features matter…"
    },
    {
        "comment": "oh god no not the cybertruck. im gonna be sick."
    },
    {
        "comment": "this is what happens when you ignore the daily reminder"
    },
    {
        "comment": "all of a sudden we’re detectives 🕵️"
    },
    {
        "comment": "not us. we travel using wormholes 🥱🌌"
    },
    {
        "comment": "I will not rest until Elon is caught"
    },
    {
        "comment": "omg duo went to hell????"
    },
    {
        "comment": "rip duo you would have loved my cheesy breadsticks"
    },
    {
        "comment": "When are the mascot auditions? 🎩"
    },
    {
        "comment": "A Chevy would never with emergency automatic braking 😭💔"
    },
    {
        "comment": "Is the skin still around? We have a lot of stuffing left in the stuffing machine…"
    },
    {
        "comment": "THE BRAND COMMENTS 😭"
    },
    {
        "comment": "it was elon musk😭"
    },
    {
        "comment": "When Duo roasts you, you know you lost"
    },
    {
        "comment": "Duo firing at Drake because he didn’t finish his lessons. 💀"
    },
    {
        "comment": "PLEASE Duo you really went there"
    },
    {
        "comment": "Duo died right after posting this... this aint no coincidence yall 💀"
    },
    {
        "comment": "the caption is DIABOLICAL"
    },
    {
        "comment": "What a diabolical ad 💀"
    },
    {
        "comment": "Duo died for this 😭"
    },
    {
        "comment": "Y'all Duolingo is being Corny"
    },
    {
        "comment": "Duo what is this behaviour 💀"
    },
    {
        "comment": "Someone take duo’s phone away 😂"
    },
    {
        "comment": "duo is dead and here you are dancing"
    },
    {
        "comment": "I think she killed duo😭😭😭"
    },
    {
        "comment": "Duo’s body is barely cold and this is what you put out"
    },
    {
        "comment": "Lily is ready for Berlin"
    },
    {
        "comment": "Are they already here to replace duo?"
    },
    {
        "comment": "how do you convince your office colleagues to join in on this"
    },
    {
        "comment": "You look a little too happy after duo died..."
    },
    {
        "comment": "But where is Vikram?"
    },
    {
        "comment": "Lily is probably the one that offed duo"
    },
    {
        "comment": "Did she kill duo fr 😭"
    },
    {
        "comment": "The suspense is clawing at us 🙀"
    },
    {
        "comment": "How much did yall pay Duo Lipa for the tweet?"
    },
    {
        "comment": "There can only be one Big Bird in tahn. 🦅"
    },
    {
        "comment": "was it death by rainbow loom hook?"
    },
    {
        "comment": "So does this mean my family is free..?"
    },
    {
        "comment": "this is not how we wanted this love story to end 😭"
    },
    {
        "comment": "We eating the green chicken tonight again?"
    },
    {
        "comment": "The people cannot rest until we know 😭"
    },
    {
        "comment": "I won’t rest til I have answers"
    },
    {
        "comment": "we're on the case"
    },
    {
        "comment": "WE WANT ANSWERS AND WE WANT THEM MEOW"
    },
    {
        "comment": "RIP Duo, he would have loved this emotional manipulation."
    },
    {
        "comment": "Reminder that this whole thing is to distract from the fact they fired their translators to replace them with AI"
    },
    {
        "comment": "DUOLINGO WE WERE SUPPOSED TO GET MARRIED 😭"
    },
    {
        "comment": "Sorry Duo, shouldn’t have fired your translators and replaced them with AI…."
    },
    {
        "comment": "Reminder that this whole thing is to distract you from the fact that they fired their translators to replace them with AI"
    },
    {
        "comment": "we’re about to become fluent in every language ever"
    },
    {
        "comment": "duo faked his own death and is now roommates with elvis"
    },
    {
        "comment": "duo if you can hear us duo, we promise to never break the streak again"
    },
    {
        "comment": "no longer suppirting u bc u fired your translating team and replaced them with ai"
    },
    {
        "comment": "What if we don’t wanna bring duo back"
    },
    {
        "comment": "im this dramatic btw"
    },
    {
        "comment": "He’s going to rise on the third day like Jesus Christ himself."
    },
    {
        "comment": "Ok you got me I’ll do my lessons to figure out how bro died"
    },
    {
        "comment": "It literally JUST ended"
    },
    {
        "comment": "Drake got cooked by duolingo too"
    },
    {
        "comment": "duo diss track when????"
    },
    {
        "comment": "drake was found in the grave after this"
    },
    {
        "comment": "Drake ain't even safe from Duolingo 😭😭😭"
    },
    {
        "comment": "This is gonna make me learn music theory"
    },
    {
        "comment": "Drake can’t even make his duolingo lesson anymore 😭🙏"
    },
    {
        "comment": "Imagine your brand being an owl and a more famous owl dunks on you..."
    },
    {
        "comment": "I swear to god you better repost this 15 years from now"
    },
    {
        "comment": "Wooh !let's go"
    },
    {
        "comment": "Duo will you be my valentine? 🥺 I've been practicing, I swear I have"
    },
    {
        "comment": "what scrolling? this is the first thing I saw when I opened the app"
    },
    {
        "comment": "The aura is immaculate"
    },
    {
        "comment": "Duo my mom lost her streak pls don’t hurt her 🙏🏻"
    },
    {
        "comment": "Jokes on you I found one 2 hours ago"
    },
    {
        "comment": "Duo can I pet that dawg?"
    },
    {
        "comment": "I haven't used doulingo in 245 days😭😭"
    },
    {
        "comment": "Coping the only way we know how, fries."
    },
    {
        "comment": "*falls to knees in Walmart*"
    },
    {
        "comment": "wasn’t expecting this delivery 😔 💜💚"
    },
    {
        "comment": "RIP Duo 😭 We’ll give you wings... in Illustrator"
    },
    {
        "comment": "pouring out a primer for our birdie baddie 😔🫗💋"
    },
    {
        "comment": "Painting a birdhouse green in honor of Duo. 💚 💙"
    },
    {
        "comment": "You were the reason I learnt Spanish. You will be missed. #RIPDuo. Or as they say in Spain… je suis désolé 🙏"
    },
    {
        "comment": "Finally."
    },
    {
        "comment": "don’t txt. eating tears instead of frosted flakes rn."
    },
    {
        "comment": "He literally sent me a death threat last night. He’s fine."
    },
    {
        "comment": "Sending our condolences 💔"
    },
    {
        "comment": "anyone that hates duo is our number 1 opp"
    },
    {
        "comment": "hey duo,you’re so funny(release my family i did my french lessons today PLEASE)"
    },
    {
        "comment": "I think Lily would ignore you even when she's not listening to music💀"
    },
    {
        "comment": "Me trying to get Duo's attention 💚🦉🖐😭"
    },
    {
        "comment": "Duolingo  got some jokes tho😭😂"
    },
    {
        "comment": "It’s always Lily😭"
    },
    {
        "comment": "That arm position is crazy"
    },
    {
        "comment": "Lily a Zari behind YOU💜"
    },
    {
        "comment": "my mom calling me from my room"
    },
    {
        "comment": "Lily forgot to roll her eyes 🤣"
    },
    {
        "comment": "Literally 😭"
    },
    {
        "comment": "him n drake would be great together they’re besties"
    },
    {
        "comment": "He wouldn't bring you up bc you would steal his spotlight 💚💚💚💚💚💚💚💚"
    },
    {
        "comment": "YO! Duo’s social media team is clever, witty and top notch! When i looked at this and read the caption i said OUTLOUD WHILST LAUGHING AND COUGHING… \n\n🗣️“Shhiiiiii+!!!”😩"
    },
    {
        "comment": "Doechii is the actual correct answer but Taylor would have been funny too lol"
    },
    {
        "comment": "I'd pick spongebob over you"
    },
    {
        "comment": "We need Taylor ❤️❤️❤️❤️❤️"
    },
    {
        "comment": "Duo you are my everything"
    },
    {
        "comment": "Okay I think that's enough for today's internet"
    },
    {
        "comment": "I would be doing more than telling a trusted adult WHAT IS THIS DUO 😭🙏🙏"
    },
    {
        "comment": "Is this who killed Duo?"
    },
    {
        "comment": "I’m telling my family about this."
    },
    {
        "comment": "Duo pls give me back my grandma"
    },
    {
        "comment": "oh i will for sure tell a trusted adult"
    },
    {
        "comment": "I SAW THIS IN CLASS AND GASPED DUO"
    },
    {
        "comment": "Hearing this song in my dreams fr"
    },
    {
        "comment": "WHY HE WINK AT ME LIKE THAT?!🤨"
    },
    {
        "comment": "I got the pony way before Duo's death 🤔"
    },
    {
        "comment": "Why did my brain sing \"poosi\" instead of \"pony\" 😭"
    },
    {
        "comment": "That thing scared me when I got it"
    },
    {
        "comment": "Can I get out of the basement?"
    },
    {
        "comment": "Duo, can you let my parents free?"
    },
    {
        "comment": "I have failed you Duo even though I haven’t I still feel it"
    },
    {
        "comment": "This is why I love duolingo"
    },
    {
        "comment": "This is why i deleted Duolingo"
    },
    {
        "comment": "i HATE THIS MEME THING WITH THE MUSIC AND SHIT AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
    },
    {
        "comment": "He died so he didn’t have to add Thai to app"
    },
    {
        "comment": "Y'all should hire me fr😭"
    },
    {
        "comment": "I feel like framing that last picture idk why"
    },
    {
        "comment": "Duolingo is gonna come up with something diabolical after this post"
    },
    {
        "comment": "duo getting a little too relatable these days"
    },
    {
        "comment": "Plot twist, shes actually going back to do her duolingo lesson!"
    },
    {
        "comment": "Noo Duo😔 you were on a streak"
    },
    {
        "comment": "Girl it’s not worth it"
    },
    {
        "comment": "NO DUO I FINALLY BROKE UP WITH HIM, DONT MAKE ME DO THIS 😭"
    },
    {
        "comment": "duo he's ghosting me"
    },
    {
        "comment": "I haven’t done my Spanish lessons sorry 😢"
    },
    {
        "comment": "This is a little too specific duo :)"
    },
    {
        "comment": "Block out (haha funny, Tetris meme)"
    },
    {
        "comment": "Duo is out of pocket for this 😂😂"
    },
    {
        "comment": "duolingo ratting me out."
    },
    {
        "comment": "I know one of those"
    },
    {
        "comment": "Wait can I borrow that hat when you’re done with it"
    },
    {
        "comment": "spelled Dumbledore wrong :("
    },
    {
        "comment": "I lost my 17 day streak 😢"
    },
    {
        "comment": "please marry me"
    },
    {
        "comment": "Keep that quest going!!"
    },
    {
        "comment": "Why did you remove stories? And you’re not doing anymore updates outside the core 8 languages? RIP Duolingo."
    },
    {
        "comment": "Me and bro when we finally lock in and learn French"
    },
    {
        "comment": "I don’t even use Duolingo, I just follow them for the premium entertainment"
    },
    {
        "comment": "Duo I have an 880 day streak are you proud of me"
    },
    {
        "comment": "Does anyone want to be my valentine?"
    },
    {
        "comment": "duo some guy took my number 1 spot and making fun of me, what can i do for revenge?"
    },
    {
        "comment": "Duolingo I skipped my Chinese lessons"
    },
    {
        "comment": "Wheres Duo in Kitty form?"
    },
    {
        "comment": "Historians will call them best friends"
    },
    {
        "comment": "Cat Lily is so iconic"
    },
    {
        "comment": "Omg wait this is adorable. We need to see the other mascots in kitty form"
    },
    {
        "comment": "sell merch of them as cats"
    },
    {
        "comment": "Duo do u know where is my cat😔 i lost him after my 100 day streak ended"
    },
    {
        "comment": "Congrats @bbnomula you are now recognized by Duolingo"
    },
    {
        "comment": "Not a threat when I need scrub daddy in every life ❤️😍"
    },
    {
        "comment": "You’re so tasty"
    },
    {
        "comment": "This post gave me the motivation I needed. Gonna do it tonight."
    },
    {
        "comment": "Blud thinks he's Duolingo"
    },
    {
        "comment": "Oh..well that’s scary no thank you😀"
    },
    {
        "comment": "You won’t find me"
    },
    {
        "comment": "Old sponges are the real threat but what do I know"
    },
    {
        "comment": "That’s how I know @scrubdaddy cares."
    },
    {
        "comment": "Is this why Duo faked their death?"
    },
    {
        "comment": "The marketing team needs a raise… I now own 29 scrubdaddy sponges and can’t stop cleaning 😂😭"
    },
    {
        "comment": "WHO COOKED HERE?!"
    },
    {
        "comment": "is this a threat 😳"
    },
    {
        "comment": "Daddy has a backstory"
    },
    {
        "comment": "this is the beginning of a movie isn’t it??"
    },
    {
        "comment": "You know what? Hell yeah, brother"
    },
    {
        "comment": "CapCut fonts have entered the chat"
    },
    {
        "comment": "Hardest edit on the internet 🙌"
    },
    {
        "comment": "I’m glad that Gen Z has taken over advertisements"
    },
    {
        "comment": "uhh this is uncomfortable… do you need privacy? 👀"
    },
    {
        "comment": "Spooning leads to forking, so I hear 🧽"
    },
    {
        "comment": "It even makes eye contact."
    },
    {
        "comment": "should’ve used a cucumber 🥒"
    },
    {
        "comment": "who gave the gen z intern the account credentials again… 😂😂😂"
    },
    {
        "comment": "Our spoons stay hella clean. 🙃"
    },
    {
        "comment": "On a Monday too"
    },
    {
        "comment": "You always leave me satisfied 🙃"
    },
    {
        "comment": "Unhinged"
    },
    {
        "comment": "On Saturday I found out The Scrub Daddy headquarters is casually in NEW JERSEY. I was out with my family and we rode past you guys. I was shocked 😭😭"
    },
    {
        "comment": "Not five below and scrub daddy beefing💀💀"
    },
    {
        "comment": "What kind of marketing strategy is this😭"
    },
    {
        "comment": "This whole death of the owl thing is the most unhinged product crossover series of all time"
    },
    {
        "comment": "Thinking of you and your family 😔"
    },
    {
        "comment": "He died from childbirth"
    },
    {
        "comment": "No child support in the will is crazy 😭😭"
    },
    {
        "comment": "how can scrub daddy still be smiling through this"
    },
    {
        "comment": "i cant begin to imagine how hard this is for you"
    },
    {
        "comment": "We got scrubdaddy knocking up duolingo owl before gta 6"
    },
    {
        "comment": "I literally saw him die in the vid before this"
    },
    {
        "comment": "How do I explain to people that Ive watched Duo give birth??"
    },
    {
        "comment": "Did bro live to scrub another day??"
    },
    {
        "comment": "the POV we all really needed to see"
    },
    {
        "comment": "How can I become a brand ambassador? I love  your products 😇"
    },
    {
        "comment": "Make a video game please. If pressure washing simulator can make money so can yours.😂"
    },
    {
        "comment": "I need to wake up there!!"
    },
    {
        "comment": "\"I've heard others say the same.\""
    },
    {
        "comment": "Need this POV everyday"
    },
    {
        "comment": "Scrub me please"
    },
    {
        "comment": "bring them to romania and u have my lei"
    },
    {
        "comment": "the hand acting is too good"
    },
    {
        "comment": "Need to make a game now. And @daz_black can play the simulator"
    },
    {
        "comment": "Faking your own death to get out of paying child support is diabolical."
    },
    {
        "comment": "You may be entitled to financial compensation"
    },
    {
        "comment": "how do i explain this to my friends who aren’t chronically online"
    },
    {
        "comment": "And while you’re at it take those kids to Build-A-Bear and buy them whatever they wantttt"
    },
    {
        "comment": "This comment section has me WHEEZING."
    },
    {
        "comment": "Are those Scrub Duos?"
    },
    {
        "comment": "Duo needs to take lessons on how to pay child support"
    },
    {
        "comment": "Millennials and Gen Z managing the social media accounts for major corporations is such a vibe"
    },
    {
        "comment": "again why is scrub daddy still smiling through all of this"
    },
    {
        "comment": "Wait, who's the mother"
    },
    {
        "comment": "u know who’d never do that to you???? ME 💔😔"
    },
    {
        "comment": "Is the king of sponges bringing raves back .. ?"
    },
    {
        "comment": "Whats the name song ?"
    },
    {
        "comment": "This is such an over 30s event... raving about a great sponge."
    },
    {
        "comment": "The best night 🔥"
    },
    {
        "comment": "Can’t even look at a sheet cake the same 😂😂😂"
    },
    {
        "comment": "ur s.o dies and the first thing u do is hit the club?? rough in the streets 😟😔"
    },
    {
        "comment": "This is the most unhinged brand and I want to be part…"
    },
    {
        "comment": "Where can I send my resume??? And should I use comic sans font?"
    },
    {
        "comment": "Lmao “Scrub da Ground” - *drops is low! 😂 See I need to be at the next party lol"
    },
    {
        "comment": "Are we going to see Beachclub Daddy next 👀"
    },
    {
        "comment": "Product so good u don’t even realize ts is an ad"
    },
    {
        "comment": "Didn't even think this was an ad"
    },
    {
        "comment": "the best ad is the one that doesnt look like one"
    },
    {
        "comment": "Nice try scrub Diddy"
    },
    {
        "comment": "I was thinking “damn I bet scrubdaddy would love this post” then I saw who posted it"
    },
    {
        "comment": "That’s why I carry one in my purse!"
    },
    {
        "comment": "i unironically think like this"
    },
    {
        "comment": "Product so good we see a meme and don't even disagree or think it could be an ad lol"
    },
    {
        "comment": "Admin needs a raise😭🙏"
    },
    {
        "comment": "Literally just bought one yesterday because Scotch Brite wasn’t scotching or briting"
    },
    {
        "comment": "In the Scrub Club, we all fam."
    },
    {
        "comment": "How quickly we move on."
    },
    {
        "comment": "The OG green birds 🦅 🥰"
    },
    {
        "comment": "TOO SOON"
    },
    {
        "comment": "SCRUB DADDY WHAT ABOUT YOUR CHILD!?! Duolingo is barely dead, and you're already trying to find another one!?!😭🤨"
    },
    {
        "comment": "Aww!!! That’s why I love you 💚"
    },
    {
        "comment": "the real reason to go to the parade"
    },
    {
        "comment": "As a Philadelphian, I approve of this message. #GOBIRDS 🦅💚"
    },
    {
        "comment": "You make brotherly love of scrubbing amazing! Fly high 💚 🧽 🦅"
    },
    {
        "comment": "My king Jalen take priority. Can you guys make a special edition eagles shaped sponge"
    },
    {
        "comment": "this green bird is better frfr GO BIRDS 🦅💚"
    },
    {
        "comment": "I need to know are there going to be owl sponges... Your little love affair was interesting to watch"
    },
    {
        "comment": "Sounds like an ad from Rick and Morty😂"
    },
    {
        "comment": "Aww too cute! 🧽"
    },
    {
        "comment": "I want the pizza the croc and the duolingo sponges 😭"
    },
    {
        "comment": "How much is it🤔"
    },
    {
        "comment": "Okay but where is duo?"
    },
    {
        "comment": "wow this was our exact wish!!!! how did you know?!?!?"
    },
    {
        "comment": "Obsessed!!"
    },
    {
        "comment": "I love Scrub Daddy button <——❤️"
    },
    {
        "comment": "We don't shop at Walmart anymore!!! But I buy them at Costco, since they support DEI 😊"
    },
    {
        "comment": "How could you continue to advertise after @duolingo death! 😭😭"
    },
    {
        "comment": "Proud of u 💜💚💛❤️"
    },
    {
        "comment": "As tough as his job is, he keeps a smile. 😃"
    },
    {
        "comment": "As a therapist this is where I get my own motivation."
    },
    {
        "comment": "Same thing I tell my family every year at the thanksgiving table"
    },
    {
        "comment": "I love scrub daddy so much pls hire me"
    },
    {
        "comment": "But you stay in my dreams"
    },
    {
        "comment": "Just scrubbin’ thru life"
    },
    {
        "comment": "this is so friday core"
    },
    {
        "comment": "If you reply back. I reenlist in April for 6 years in the Navy with a Scrub Daddy  on my front pocket. Already gonna sing the jingle of @jgwentworth . I want to keep this going."
    },
    {
        "comment": "This was meant for @duolingo"
    },
    {
        "comment": "is scrub daddy ovulating"
    },
    {
        "comment": "Duo literally just died and they’re moving on"
    },
    {
        "comment": "This from the official account is crazy😭(it’s iconic)"
    },
    {
        "comment": "At this point, it's not shocking for this to me on my feed"
    },
    {
        "comment": "Iconic king."
    },
    {
        "comment": "Happy Valentine’s Day!"
    },
    {
        "comment": "My sweetheart bought me a scrub mommy for valentines day i am not even joking"
    },
    {
        "comment": "Tell me if scrub mommy is single"
    },
    {
        "comment": "scrub daddy i can’t read that fast 😭"
    },
    {
        "comment": "Omg. First Duo, then flipping Build-a-bear, and now Scrub daddy🤦‍♀️ All ya'll brands need to take a long walk and several cold showers before posting lol."
    },
    {
        "comment": "I guess we know who killed duo"
    },
    {
        "comment": "eyebrows on fleek"
    },
    {
        "comment": "HE LOOKED RIGHT AT THE CAMERA"
    },
    {
        "comment": "fantastic look on u"
    },
    {
        "comment": "It’s almost like you’re telling me to… stay?! 😎"
    },
    {
        "comment": "Who else has a cultural impact that spans from Super Bowl to Scrub Daddy 😂"
    },
    {
        "comment": "Say, Drake, I hear you like 'em young🔥🔥🔥"
    },
    {
        "comment": "Wow scrub daddy, you really are a sponge of all trades 🎤🎤"
    },
    {
        "comment": "O M G 😂 I love this"
    },
    {
        "comment": "Damn moved on that fast Duo hasn’t even had his funeral yet 😭"
    },
    {
        "comment": "Duo hasn’t even been gone that long 😭 if you wanted to leave you didn’t have to take them out ☠️"
    },
    {
        "comment": "you’ll have to get me a gift first daddy"
    },
    {
        "comment": "Sorry… Scrub mommy already asked me💕"
    },
    {
        "comment": "Moving on from Duo pretty fast don’t u think??"
    },
    {
        "comment": "duos body is still warm 😭"
    },
    {
        "comment": "is this a safe space?"
    },
    {
        "comment": "You’re moving on too quick"
    },
    {
        "comment": "Didn’t you just lose your pookie duo…look how fast you’ve moved on"
    },
    {
        "comment": "scrubbed with love 🙂‍↕️🥰"
    },
    {
        "comment": "I’m ready"
    },
    {
        "comment": "Are they only being sold online? I’ve checked stores every time I go in and have been unable to find the valentines sponges 😭"
    },
    {
        "comment": "Gonna scrub some things with love in those holes this holiday"
    },
    {
        "comment": "YES I WILL BE YOUR VALENTINE 😍"
    },
    {
        "comment": "smini was here"
    },
    {
        "comment": "what sponge is behind the camera though?? 👀"
    },
    {
        "comment": "Omg to see my tattoo on nails is amazing!!! I need these to match!! Amazing work! ❤️❤️❤️❤️"
    },
    {
        "comment": "showing this to my nail tech"
    },
    {
        "comment": "Oh my lord 🔥🔥🔥"
    },
    {
        "comment": "Oh my god stop! I love these"
    },
    {
        "comment": "Yessss 😍x"
    },
    {
        "comment": "Did you find it????"
    },
    {
        "comment": "I saw it flying around up here somewhere"
    },
    {
        "comment": "You look beautiful either way 💕✨"
    },
    {
        "comment": "I think I saw it over New Orleans!!"
    },
    {
        "comment": "Quick with it"
    },
    {
        "comment": "Ok all the comments from brands 😂"
    },
    {
        "comment": "A dog grabbed it and ran! \nBut not to fear, most baddies love dogs and we’re sure one will find the dog with the ‘stache and return to you.😉 \n#matchmaker 😎"
    },
    {
        "comment": "Wth is going on with mustaches flying away on all these ads 😭"
    },
    {
        "comment": "we can talk about mustache, but does it come with scrubussy?"
    },
    {
        "comment": "At least you still look good in yellow"
    },
    {
        "comment": "not the mustache 😂"
    },
    {
        "comment": "SEND ME ONE PLEASE 😢 I BOUGHT 3 pack & it ripped in half first use. I even have the t shirt ! @scubdaddy"
    },
    {
        "comment": "Sounds like clean fun!!!"
    },
    {
        "comment": "My boyfriend insulted my scrub collection, should I dump him ? (He dared asking for a \"real\" sponge)"
    },
    {
        "comment": "So is this one ☺️"
    },
    {
        "comment": "Love this for you"
    },
    {
        "comment": "Whoever runs this page job goals"
    },
    {
        "comment": "These posts lately are gold 😭🤣 please give your social media employees a raise!"
    },
    {
        "comment": "She scrub my daddy till I sponge 🤤"
    },
    {
        "comment": "wait... what do you stick in the eyes? /gen"
    },
    {
        "comment": "Oh I’m gonna shøve something in your mouth alright…"
    },
    {
        "comment": "Nice try, Scrub Diddy"
    },
    {
        "comment": "Add more holes for shoving things in"
    },
    {
        "comment": "You guys saved this trend"
    },
    {
        "comment": "i'll shove something else in ur mouth scrub daddy 👅👅👅"
    },
    {
        "comment": "I'm gonna eat a scrub daddy and hope it cleans my insides"
    },
    {
        "comment": "scrub daddy plz notice me i love you so much you are my world and life i look forward to when you post bc i just have to be here for you i love you so much ur literslly the sweetest little sponge ever"
    },
    {
        "comment": "When are you dropping the onlyfans???"
    },
    {
        "comment": "I CONVINCED MY MOMMA TO GET ONE 🦅🦅🦅"
    },
    {
        "comment": "😂😂 DADDY & Eagles vs Chiefs\nFly high 🦅"
    },
    {
        "comment": "Do u have the spongussy"
    },
    {
        "comment": "This the real season @philadelphiaeagles won"
    },
    {
        "comment": "can we hear a little commotion for the tracksuits 👏👏👏"
    },
    {
        "comment": "Gen z has had an amazing influence on commercial culture Jesus"
    },
    {
        "comment": "How do I apply to be apart of the Scrub Daddy team?"
    },
    {
        "comment": "That track suit is everything!! I would wear it to clean with my scrub daddy & scrub mommy sponge!! 😂🥰 this just made my day! 🤣🤗"
    },
    {
        "comment": "Let’s go Trap ! 🤞🏾❤️ proud of ya"
    },
    {
        "comment": "Is this Charli XCX or is this the intern’s new bop? Either way 🔥"
    },
    {
        "comment": "Social media is wild these days😂😂😂 and im all for it"
    },
    {
        "comment": "@mamabear_1208 @poproxx21_13 this the jam of summer 25’"
    },
    {
        "comment": "We are 🥰"
    },
    {
        "comment": "Yeah, but you’re washing and I’m drying! 🧽🍽️"
    },
    {
        "comment": "we've cleared our schedule 😉"
    },
    {
        "comment": "That smirk 😏"
    },
    {
        "comment": "I love this brand, but I can never find products in CT near me please expand in stop and shop CVS Walmart"
    },
    {
        "comment": "I'm just a chill guy ☺️"
    },
    {
        "comment": "What if i am inappropriate? What are you gonna do?"
    },
    {
        "comment": "I really thought you were going to scrub that red ball in front of target"
    },
    {
        "comment": "Scrub hub has a whooooole different meaning for nurses and I was thoroughly confused 😂😂😅"
    },
    {
        "comment": "So, it’s a multitool — kitchen and bedroom uses?"
    },
    {
        "comment": "Don’t you hold it with fingers in the eyes and mouth though? 😮"
    },
    {
        "comment": "On my way to Target😍"
    },
    {
        "comment": "Man that’s so fun im wishlisting it 😂"
    },
    {
        "comment": "Do you sell this anywhere else other than Target???"
    },
    {
        "comment": "Do I have to verify my age to get Scrubhub?"
    },
    {
        "comment": "I was at my Target yesterday & didn’t see this 😞"
    },
    {
        "comment": "I can't wait to buy one and stick it inside me 😍"
    },
    {
        "comment": "🏃🏽‍♀️ to Target ."
    },
    {
        "comment": "Hey @scrubdaddy , can we chat?\n\nWhen your sponges first hit the scene, they were EVERYTHING—durable, reliable, and my go-to for any cleaning job. But lately? Two weeks in and they’re falling apart on me like a bad breakup.\n\nDid something change with the formula? Because I need my sponges to last, not leave me hanging. If this is about making us buy more, it’s not working—it’s just making me want to find a better option with lasting power. Please bring back the quality I fell in love with. 🧽✨ #CleanQueenNeedsAnswers"
    },
    {
        "comment": "What an amazing legacy he left ❤️"
    },
    {
        "comment": "i knew I loved you most"
    },
    {
        "comment": "Well said, @scrubdaddy - we need love, so much of it"
    },
    {
        "comment": "❤️ We honor a King today .. Thank you @scrubdaddy"
    },
    {
        "comment": "I was expecting Duolingo"
    },
    {
        "comment": "😂 Great marketing"
    },
    {
        "comment": "Completely unhinged... I'm here for it"
    },
    {
        "comment": "Mordecai and Rigby"
    },
    {
        "comment": "An unbeatable duo hmmm…. Loudr x Scrub Daddy 🧽🔊"
    },
    {
        "comment": "Scrub Zaddy when? Make it gray 😂"
    },
    {
        "comment": "Hey @scrubdaddy can you guys make shower body sponges, foot scrub sponges and Loofas next?!? That’s the duo we want! 😍"
    },
    {
        "comment": "Hi!  I just emailed you because my sponge only lasted a week. I'm very sad because I spent $6 thinking it would be worth it 😢"
    },
    {
        "comment": "Make a giant scrub daddy, wet it , and squeeze it out on top of the city."
    },
    {
        "comment": "❤️ you know that it's really ashamed that just one person caused this fire by themselves who ever they arrested for this crime should be held responsible for what damage he called he she whoever they arrested for this I mean that's not a climate change somebody just literally done this on purpose why they did it don't know but this is what I'm talking about things have got to change in our country and if they're not going to change it then we need to start making some changes for them we pay the taxes were the reason why they're in their offices were the reason why people make decisions every day for the American people but it seems like to me that the American people can't speak anything done and it's sad to see all them homes on fire why didn't they get water from the ocean there's plenty of water on the ocean to put all that fire out you're telling me that nobody could do that that's wrong and to me that's saying well if your house catch on fire we're not going to put it out there is so much water in the ocean that should have been put out the homes that burned down should have never burned down this thing should have been resolved a lot sooner instead of going on like it is water puts fire out guess what there is plenty of water out there to put them fires out what is going on it's like it's intentional to burn those homes down for a reason but why so what's going on for California somebody's got something in play I mean they won't get water from the ocean they don't have no backup water no something is going on why burn all that stuff down unless there's a reason why you can't trust nobody in our government at all not one single person is for the American people only American people for American people themselves y'all guys need to check anybody that's in that fire lost everything he needs to check it out and start investigating them the sales and find out why this happened cuz I guarantee you they're going to find out that it's more to one than one person been arrested for starting a fire"
    },
    {
        "comment": "Cook then"
    },
    {
        "comment": "just sent this to my boss"
    },
    {
        "comment": "Literally tho 😅😅😅"
    },
    {
        "comment": "we’ll miss you"
    },
    {
        "comment": "Ok, I for one instantly went to ‘the sponge’ from the early 90’s. 😂😂"
    },
    {
        "comment": "In SCRUB DADDY we trust…quitters never prosper⚡️👑"
    },
    {
        "comment": "I got a little heart attack i though by the \"i quit\" like its a post of closing, don't ever ever do that again please. My heart is to fragile to not be able clean with those sponge \nWhen you go black you can never go back 😂😂😂😂 (especially not to that weird un useful green yellow sponge that stink every 3 days)"
    },
    {
        "comment": "Lock in and scrub hard, daddy 😌"
    },
    {
        "comment": "I forget this is real"
    },
    {
        "comment": "I want to touch you."
    },
    {
        "comment": "When i...when i went to the grocery store... walking aimlessly thru the aisle...and there it is, A SCRUB DADDY SPONGE. I immediately grabbed one and went to checkout and drove back home as fast as i could. Opened the pack of scrub daddy and uoghjhhh aughhh nghh wowwwwww.... Scrub Daddy."
    },
    {
        "comment": "you may send me tha best sponges you got"
    },
    {
        "comment": "Seeing that dry erase board with a cleaning schedule hurts my heart. This person wanted to keep her home clean, and took steps to keep her home clean, but couldn’t do it and then had to be reminded of her “failure” every time she saw that dry erase board. That’s hard on someone who’s already struggling."
    },
    {
        "comment": "I started buying scrub daddy after watching your videos and seeing how well they worked! Your kindness is always so uplifting!!"
    },
    {
        "comment": "Scrub Daddy's generosity and direct impact is what true corporate social responsibility looks like. ✨ What you do it phenomenal, and it's encouraging to see a corporation care for individuals this way."
    },
    {
        "comment": "Wow! Amazing work! Love the thought and effort put towards the mental health side of this project ❤️ that’s why I always give my audience 4 weeks of free therapy vouchers just for reaching out. It’s so hard to make that first step 🥲"
    },
    {
        "comment": "👏👏👏👏👏👏 amazing! And Scrub Daddy is amazing for sponsoring these cleans. One of the reasons we keep buying Scrub Daddy products!"
    },
    {
        "comment": "The weight you've probably lifted off her shoulders! ❤️❤️"
    },
    {
        "comment": "I love that Scrub Daddy is so supportive of you and your team and your work helping those with mental health issues. It’s a real, practical and genuinely life transforming social contribution x"
    },
    {
        "comment": "THIS, I USE SCRUB DADDY BECAUSE OF THIS PAGE❤️"
    },
    {
        "comment": "Thank God for the fire alarm"
    },
    {
        "comment": "Amazing!!! I am crying both sad and happy tears for her! Awesome, Scrub Daddy; compassion and unity, humanity on full display. 💗💞💗"
    },
    {
        "comment": "Scrub Daddy’s kindness is why I switched to@their products."
    },
    {
        "comment": "Question:  are the people,  that is helped, able to keep up on the cleaning after a clean team has come in and  did a reset for their rooms/house?"
    },
    {
        "comment": "Bcuz of how amazing you are and how amazing scrub daddy has been to help you with all these cleanings, I always support and by scrubby daddy cleaning supplies. I think it’s amazing what you and Scrub daddy do to change lives! 👏🙌❤️"
    },
    {
        "comment": "Love this transformation and especially the compassion for the folks living with these  situation \nWhat this world needs so much right now is love acts of kindness generosity and selflessness \nThank you @nottheworstcleaner_  @scrubdaddy  and everyone else making this happen ❤️"
    },
    {
        "comment": "How does one acquire this job"
    },
    {
        "comment": "Never thought my cleaning life and SpongeBob life would converge"
    },
    {
        "comment": "IS THAT A SCRUB DADDY HOOKAH?!???? 🧎🏽‍♂️🧎🏽‍♂️"
    },
    {
        "comment": "You had me at tacobell"
    },
    {
        "comment": "missing something i think"
    },
    {
        "comment": "The taco bell receipt 😂"
    },
    {
        "comment": "THE DUO SPONGE LEAK"
    },
    {
        "comment": "Can you make a limited freak daddy edition with a tongue"
    },
    {
        "comment": "I only support the use of LC signs here on insta gotta hit my man Tony"
    },
    {
        "comment": "Scrub daddy u light up our lives"
    },
    {
        "comment": "that taco bell receipt is only comically long because of how comically long the number that you have to pay is"
    },
    {
        "comment": "Only thing it’s missing is me"
    },
    {
        "comment": "I wanna scrub mommy"
    },
    {
        "comment": "I love the sponge, but I think if my house burnt down, this would be the absolute least of my worry. Why do I need to worry about cleaning my dishes when my kitchen is gone."
    },
    {
        "comment": "and this is why your business thrives! Thank you for going the extra mile, love this! 🙏"
    },
    {
        "comment": "Wholesome scrub daddy"
    },
    {
        "comment": "That's great but hope you all did the saying for folks in North Carolina"
    },
    {
        "comment": "Didn’t think I could love Scrub Daddy more then this 💚"
    },
    {
        "comment": "Thank you for all you do. Some are doing nothing"
    },
    {
        "comment": "This is awesome! Especially for cleaning up any items that are salvageable"
    },
    {
        "comment": "Nice try scrub diddy"
    },
    {
        "comment": "They used to call me “scrub mommy” in high school btw"
    },
    {
        "comment": "I have all your products"
    },
    {
        "comment": "I think touch.tonet likes this video"
    },
    {
        "comment": "touch.tonet needs to get a life"
    },
    {
        "comment": "damn im an early birdie"
    },
    {
        "comment": "Touch.tonet needs to be stopped"
    },
    {
        "comment": "touch.tonet gave me fentanyl"
    },
    {
        "comment": "@touch.tonet Is doing tricks on it 😭🙏"
    },
    {
        "comment": "I touched @touch.tonet"
    },
    {
        "comment": "Scrub Daddy and Duolingo admins are on smth else. 💀"
    },
    {
        "comment": "I love that my generation has entered the workforce"
    },
    {
        "comment": "I just opened this app 😭"
    },
    {
        "comment": "never failing to be completely out of pocket"
    },
    {
        "comment": "Jaw?\nDropped.\nFlabbers?\nGhasted."
    },
    {
        "comment": "Took me too long to realize it’s the Actual scrub daddy page 😭"
    },
    {
        "comment": "little.... little what...?"
    },
    {
        "comment": "No cuz your marketing is next level 🧽🫧😭💦💦"
    },
    {
        "comment": "First it was Duolingo, now Scrub daddy!?"
    },
    {
        "comment": "She scrub my daddy till a cif cream 🤤"
    },
    {
        "comment": "This brings me hope"
    },
    {
        "comment": "We forgive you"
    },
    {
        "comment": "😂😂😂😂 Social media manager needs a raise"
    },
    {
        "comment": "Collaboration 😳😳🙏🙏"
    },
    {
        "comment": "You need a raise."
    },
    {
        "comment": "Can lizards use these sponges?"
    },
    {
        "comment": "Aww so your not GOING TO GET TOUCHED 😭😭😭"
    },
    {
        "comment": "SCRUBDADDY I LOVE YOU PLS CAN I MAKE SOME ART FOR YOU!!!!"
    },
    {
        "comment": "Dw I already scrubbed it from my memory"
    },
    {
        "comment": "Dam saw that"
    },
    {
        "comment": "38 seconds ago is... life-changing... I live you scrubdaddy😢"
    },
    {
        "comment": "Daddy scrub me please"
    },
    {
        "comment": "I want daddy to scrub me next 😍"
    },
    {
        "comment": "we love the energy mr scrub daddy man"
    },
    {
        "comment": "I want daddy to scrub my potatoes"
    },
    {
        "comment": "Scrub daddy or mommy are the best, can't live without them"
    },
    {
        "comment": "I feel like Scrub Mommy would’ve rocked it too. She’s my favorite. 😂"
    },
    {
        "comment": "the way that I felt is was actually a good hack 🧍🏻‍♀️"
    },
    {
        "comment": "I appreciate your passion for scrubbing"
    },
    {
        "comment": "This is how I scrub mine! It works so well!"
    },
    {
        "comment": "I love whoever is managing the social media 😂"
    },
    {
        "comment": "Seeing you use that red drill just broke our hearts 💔"
    },
    {
        "comment": "scrub daddy is a man of science"
    },
    {
        "comment": "You sound a bit like Ryan Reynolds"
    },
    {
        "comment": "I want to be potato peeled with a scrub daddy now"
    },
    {
        "comment": "Why do you sound like Ryan Reynolds("
    },
    {
        "comment": "Ummmm… Can we enter? 🤭 @scrubdaddy @laneige_us"
    },
    {
        "comment": "Good luck everyone! 🤍"
    },
    {
        "comment": "I’d love this! 🫧😍🧽"
    },
    {
        "comment": "All the products are 100000/100000"
    },
    {
        "comment": "@chiree815 \n@phyllisbooker \n@kitabooker"
    },
    {
        "comment": "@l_i_n_z_c ill share some scrub daddy’s is I win lol"
    },
    {
        "comment": "We have plenty of Scrub Daddy's to hold us for a few more months. 🥰😁🤘❤️"
    },
    {
        "comment": "Got a fresh scrub daddy right before Christmas, I'm good 🙌"
    },
    {
        "comment": "These are the BEST ❤️"
    },
    {
        "comment": "Mentioned this exact feature on our blog !"
    },
    {
        "comment": "That’s all I use!! Want some Warm Scrubs ❤️🔥 Happy New Year 🎆"
    },
    {
        "comment": "❤️😁I just changed mine today! Happy New Year Scrub Daddy! 🎉"
    },
    {
        "comment": "I've bought scrub daddy only once this year.  It was at costco and I'm on my 3rd to last sponge. I'll be buying a new pack soon."
    },
    {
        "comment": "2024 was the year I tried @scrubdaddy sponges and I’m a customer for life, best sponge I’ve ever used"
    },
    {
        "comment": "Reels are better than TikTok…anyway, love you, Daddy"
    },
    {
        "comment": "These reels aren’t hittin 😩"
    },
    {
        "comment": "i swear these comments are not the same 😭😭😭 i miss tiktok already. hold me scrub daddy…."
    },
    {
        "comment": "THANK GOD I FOUND YOU GUYS!  YALL ARE HALARIOUS😂"
    },
    {
        "comment": "Leave it to Scrubdaddy to make this us laugh during these dark times 😂"
    },
    {
        "comment": "I WANNA GO HOME 😭"
    },
    {
        "comment": "Yes scroll"
    },
    {
        "comment": "i hate it here 😭😩"
    },
    {
        "comment": "Y'all just haven't made it to the wild side of the 'gram yet. You'll know you're there once you come across cartelgram"
    },
    {
        "comment": "@scrubdaddy  is my sons favorite. He has autism and your YouTube videos and Tik toks make him laugh. We bought a ton of them"
    },
    {
        "comment": "Happy new year ❤️"
    },
    {
        "comment": "Yes guys! Absolutely smashing it and can’t wait for 2025 ❤️😍"
    },
    {
        "comment": "Congratulations 🎉"
    },
    {
        "comment": "We love you guys congrats 🎉 and happy new years 🥳"
    },
    {
        "comment": "Can’t wait for 2025 🙂‍↔️✨"
    },
    {
        "comment": "Love this ❤️"
    },
    {
        "comment": "Happy New Year"
    },
    {
        "comment": "Can’t wait for 2025👏🏻🎉"
    },
    {
        "comment": "The worst collaboration ever for zara"
    },
    {
        "comment": "If it’s not smart or kind or inspiring or touching, what is this collection for?"
    },
    {
        "comment": "Also, why is it when you ask to speak to a supervisor, the rep says they are not available. No one reached back out and or email regarding the concern."
    },
    {
        "comment": "ZARA Let’s talk about your standards in returns. I send you a return, I have confirmation, you don’t have articles in magazine and you don’t pay. Does clutter in the warehouse mean a loss for the customer? Really? In such a big firm? :("
    },
    {
        "comment": "Let's talk about your continued support of the Israeli regime in unaliving tens of thousands of innocent Palestinian people, slightly more important than fashion! Let's talk about that!"
    },
    {
        "comment": "You call it fashion?😂"
    },
    {
        "comment": "CUSTOMERS BEWARE! DO NOT SHOP AT ZARA.  THEY WILL STEAL FROM YOU LIKE THEY DID ME.  TWO SEPARATE TIMES, I RETURNED ITEMS BY MAIL AND THEY CLAIM THEY DIDNT RECEIVE THEM IN THEIR WAREHOUSE (I HAVE PROOF OF DELIVERY) AND THEY WONT REFUND MY MONEY!  A LONG TIME LOYAL CUSTOMER AND THEY STEAL FROM ME AND THEY WILL DO THE SAME TO YOU!"
    },
    {
        "comment": "Nope, let’s talk about how @zara does not refund for items sent back and when you call customer service the rep tells you sorry but the warehouse received items, and yet no refunds. I’m a very unhappy customer"
    },
    {
        "comment": "Start recording what you place back in your return boxes as Zara is accepting returns but not returning funds…tracking number said delivered yet no refunds. Be careful ordering from them"
    },
    {
        "comment": "Never buying from Zara your customer service is non existent and when products are returned they go missing and are not refunded to the customer."
    },
    {
        "comment": "Returning to the russian market means sponsoring the war"
    },
    {
        "comment": "Geez, I didn’t realise it was a thing that you don’t refund or give a sh1t that customers email. I’ve given up trying to get my refund."
    },
    {
        "comment": "Still I am waiting for my refund there is no update"
    },
    {
        "comment": "Lovely Collection 😍"
    },
    {
        "comment": "Direct plz"
    },
    {
        "comment": "I have been waiting for my order for 2 weeks now, no news from it... customer service is really bad and rude, I got no help or any informations. This is a shame."
    },
    {
        "comment": "ZARA CUSTOMERS BEWARE!!!!!!\nreturned my order, and Zara confirmed they received it, yet they've been\n'processing my refund' for THREE MONTHS with no resolution. After looking into it, l've seen MANY other customers experiencing the same issue-some never even receive their orders, and Zara still keeps their money."
    },
    {
        "comment": "The Oversized Denim Jacket with the printed scarf, is the scarf detachable?"
    },
    {
        "comment": "Hello, I am writing from Kyrgyzstan, and want to know an information about Zara’s mystery box, on Instagram I have seen the advertisement about sending these boxes from Zara to Kyrgyzstan, it is written that we can choose a style of thing in the box. I would like to emphasise is truth or fraud?it is written that we have to pay only for delivery"
    },
    {
        "comment": "unimpressive - same as usual - m and s doing. lot better than zara these days 🤷‍♀️"
    },
    {
        "comment": "I was provided a usps+ups innovation return label and had driven to two usps stores and one ups store, but none would accept it. Bc they say that the contract between the carriers have stopped. So I requested a new shipping label with a single carrier. But the cs could only generate the same hybrid lable that no carrier can take/scan. Then I was told by zara (opened a case) to wait for further investigation. While i was waiting, the orders have passed 30 return window. SO the stores won't refund me either! But it was your fault from the beginning and why would I have to pay for your mistake? As of right now, there is still no solution provided by zara. Please, I want to return and get my refund!"
    },
    {
        "comment": "Dear Zara Customer Service,\n\nI am writing to formally raise a complaint regarding my recent order. I wish to return the item in accordance with my consumer rights; however, I have been informed that a home collection is required as the item is large, after 3 attempts of trying to get a label sent via your agents on what’s app no courier has has arrived - this is ongoing now for 2 weeks and the window to return the item is closing. \n\nUnder the Consumer Contracts Regulations 2013, consumers have the right to return goods purchased online within 14 days of receipt for a full refund, including the cost of standard delivery. While retailers may set return methods, these must be fair and reasonable. Forcing a home collection, particularly when alternative return options exist, may not align with these legal requirements.\n\nI kindly request that Zara provide a return option that is both reasonable and compliant with consumer law. If this issue is not resolved satisfactorily, I will have no choice but to escalate my complaint to Trading Standards and seek further advice from Citizens Advice UK.\n\nPlease confirm how you will proceed with my return at your earliest convenience.\n\nI have sent multiple DM’s which have been ignored and I do not wish to waste my hours contacting your customer service which is absolutely appalling."
    },
    {
        "comment": "Shame! They are stealling money! Lets see how you explain the case in tv if you immediately would not refund me."
    },
    {
        "comment": "I placed an order today and been charge them it’s showed that been canceled but still showing the charge"
    },
    {
        "comment": "Shocking customer service! Faulty item bought in store & telling me I need to return it to a store which is 60 miles away!"
    },
    {
        "comment": "Never buying from Zara Australia again... you've basically have ripped me off have never refunded me for products returned @zara"
    },
    {
        "comment": "Zara supports the war in Europe"
    },
    {
        "comment": "It looks gr8, cuz it's very good shop 2 buy clothes."
    },
    {
        "comment": "WHERE IS MY REFUND???????????"
    },
    {
        "comment": "Where is my money zara? I have been waiting for my refund 30 days ago"
    },
    {
        "comment": "FB has an entire complaint page with 1,000 members that I recently joined, with similar complaints!  Never gonna buy from Zara again!!!!! \nThey are accusing me of wearing an item that I returned and not giving me my money back. I only tried it on once and immediately put back into box to ship back!  Never ever wore the item"
    },
    {
        "comment": "Hi, I received my order from Zara India on 13th Feb(online), & raised a return request by 14th Feb and the parcel was picked up the next day. I never received a confirmation of the pick-up. I only heard from zara on 23rd feb saying they had received the return without the label & I would therefore have to take it back. They told me to give them my address so they can send it back to me.\nThe way returns are usually done, the delivery person quality checks the item to ensure the label is intact before accepting it so how is it possible that in this case he passed it but only when it reached the warehouse did they realize this? This is a complete scam that is happening either by the delivery person or by zara to discourage returning. I have made several online purchases & know better than to do something like this. I need help to speak to the right person & get a fair resolution in this case because this was an item worth 7000, it did not suit me so I do not want to keep it, I can’t forego so much money like this."
    },
    {
        "comment": "Never got my package from Zara! . No help from the support team either.."
    },
    {
        "comment": "#1 dress is beautiful to be a evening outfit too!!!😍😍😍"
    },
    {
        "comment": "🚨 @ZARA, this is unacceptable. I returned two items, but you only registered one. I have been claiming for over 14 days, sent more than 20 emails, and all I get are generic responses with no solution.\nI have the return receipt and have filed complaints with both the OCU and Consumer Affairs. The lack of response and handling of this issue are highly disappointing. Is this how you treat your customers? I expect an immediate solution.\n#Zara #CustomerService #Complaint"
    },
    {
        "comment": "Customer service is terrible I have been charged for items that have been sent back. Keep getting the same responses. So bad."
    },
    {
        "comment": "I am so disappointed! Whatever I order right now is not arriving. One of my packages I am waiting since February 3 and no one knows when it will arrive. There is no information …"
    },
    {
        "comment": "Ordered a fur coat from Zara! a couple of weeks ago still haven’t received my order despite reaching out to customer service and they were very unhelpful. I am very disappointed in knowing that they are using a cheap logistics company who is not delivering my package."
    },
    {
        "comment": "Beware! Don’t shop online at Zara. They sent me the wrong item and refused to issue a refund. The second time, they sent me an old, unrelated item, and once again, they refused to refund my purchase. I even have video recordings of the pickup and delivery times, but they are making excuses related to their warehouse."
    },
    {
        "comment": "ZARA ABSOLUTE NAILING IT 👏👏"
    },
    {
        "comment": "Can you not be completely useless and actually assist me with my refund? I have contacted you guys time and time again through the various useless methods and I still haven’t had my refund. It’s been over two weeks."
    },
    {
        "comment": "Plz i need my refund,  what is going in here how come a retail company like zara does not give backbtheir MONEY U SHOULD B DRAGGED TO COURT"
    },
    {
        "comment": "God understands your soul"
    },
    {
        "comment": "Why so serious?"
    },
    {
        "comment": "Hello @zara ! When will be processed the refunds for the orders 53629733423, 53618219959? The parcel was received on February,13."
    },
    {
        "comment": "It’s been very troublesome to return an item to Zara, despite I’m someone who is already in apparel industry. The reason is nonchalant behavior of the shop manager; the people/ brands who are already familiar with Turkish market know that our own Turkish brands have quite flexible return policies however apparently the same don’t apply to Inditex brands. I bought the item with the code 53918097624 Zara online which I had already purchased similar style previously from other Inditex brands. Contrary to the previous items, these shoes happened to have very stiff material and have a piping inside. I didn’t mind the stiff material upon purchasing, however piping cut my ankle badly after wearing for a day. When I discussed this with a Zara sales assistant, I’ve been informed that it has 2 year guarantee and can be exchanged. However after going to the store (Mall of Istanbul) for the exchange, the store manager refused my request and claimed that product is not faulty without even having looked into the product which was supposed to be sent for review of the quality team or at least someone who has technical competency on the matter. Saying that if the product was taken in to be reviewed by technical team, I would’ve accepted the outcome after being provided a logical explanation, however I’m not accepting this result neither as a customer nor -as I said- being a professional in the industry. Hence I would like to urgently get a logical explanation for the matter and demand a solution.Thanks"
    },
    {
        "comment": "@zara your poor customer service is now calling me a liar that I didn’t send 2 out of 3 items. SHAME on you.! You’re losing your loyal customers.  Will never ever buy anything again.!"
    },
    {
        "comment": "One Of The Best Ads Yall Ever Shot Respectfully 🔥🔥"
    },
    {
        "comment": "I had a Prada coat like this early 2000."
    },
    {
        "comment": "I’m a very unhappy customer. Zara is keeping items in warehouse and not refunding"
    },
    {
        "comment": "🚨🚨 ZARA CUSTOMERS BEWARE!!!!! I returned my order, and Zara confirmed they received it, yet they’ve been ‘processing my refund’ for two months with no resolution. After looking into it, I’ve seen MANY other customers experiencing the same issue—some never even receive their orders, and Zara still keeps their money."
    },
    {
        "comment": "Just Dmed you about my orders"
    },
    {
        "comment": "please provide a number or address for a complaint regarding Zara store service"
    },
    {
        "comment": "He Zara, I placed a large order n° 53606562845 on 24/01. I still haven't received this order. I tried your customer service many times but keep getting the same answer: ‘we are working on it’. Please find a solution or refund asap. Shameful!"
    },
    {
        "comment": "Zara always the best 🤍🩶🤎"
    },
    {
        "comment": "Don't know what happened to Zara. They used to be good at customer service atleast. I have been chasing them for more than 3 months for a refund. I returned 4 items in the store and they issued a refund for only 3. Why are you scamming us like this? Is this the downfall of Zara? Are you people in that desperate need of money"
    },
    {
        "comment": "zara gave my order to someone else and said it was my fault and that I made it up because “I know the person” with 0 proof. I would really like my refund"
    },
    {
        "comment": "Okay!! So my order was picked after a month or long by @ecomexpressltd and I got the refund or the entire order except one item in it. And you are telling me that this item did not reach you. How is that possible @zara . I need you to check with logistics either return the item or give me the refund. \n\nThat is why no one was picking this order because you guys will mess up and pick up guy will have to pay for it."
    },
    {
        "comment": "I place an online order with an employee on the 27th of December 2024, I payed and got the receipt but then zara mixed up emails and actually put the delivery info to pick up the under another persons name and email (only the paying info was under my name and email). I brought this up to Zara’s attention on the 12/01/25 because it said that my order was delivered, and on the 20/01/25 after i already complained the person returned the items and got my money ( I payed in cash) using the QR code on the app (because again they put the pick up info under that person’s instead of mine). \nZara costumer service accused me of making it up and knowing the person saying they won’t give my money back. @zara"
    },
    {
        "comment": "My issue has been solved. Thank you!"
    },
    {
        "comment": "Still waiting for my money back after I was charged twice instore and no one will reply to me via any channel!!! 😭😭😭"
    },
    {
        "comment": "They are only work for profit, zero customer service, zero loyalty and unnecessary arrogance from their employees, only pretending they are working on complaints and at last send mail that we are apologising. Such a bad service from this level of management and companies. And they are asking for proof to us do we receive or not? Do you have any proof you will sent us or not?"
    },
    {
        "comment": "Waiting for my refund it’s been 8 months !!"
    },
    {
        "comment": "This look is giving major luxury vibes! Who else agrees? 👏✨ #LifeWithELZOVA"
    },
    {
        "comment": "🔥love this brand"
    },
    {
        "comment": "The new website sucks"
    },
    {
        "comment": "Wow, I also have a brand in my name. I am happy 😍😍"
    },
    {
        "comment": "What can you do, as a customer, if you haven’t received your order in 5 days because it is damaged in the courier’s warehouse and Zara personnel is really rude and do not want to help you? Can anyone advise?"
    },
    {
        "comment": "It’s been over a month, and still no refund. Zara confirmed they received my return (#54009229268), yet every time I contact customer service, I get the same generic response with no real solution. This is unacceptable. If I had known the process would be this slow, I would have returned my items in-store instead. Zara, issue my refund—including the return fee—immediately. This delay is completely unfair to your customers. Has anyone else had trouble getting their refund from Zara?"
    },
    {
        "comment": "Cool"
    },
    {
        "comment": "Introduce xs for men in zara india , avg indian male  height is 5.6"
    },
    {
        "comment": "Obsessed with this! 🔥 What’s your favorite piece? 😍"
    },
    {
        "comment": "Timeless, elegant, and powerful. Just how fashion should be! 💎"
    },
    {
        "comment": "Team Costco"
    },
    {
        "comment": "Should of picked Costco chef."
    },
    {
        "comment": "Who needs something from Costco?"
    },
    {
        "comment": "A giant nope on Target and union busters too"
    },
    {
        "comment": "Sorry Chef if you had picked another store like Costco, I would have gladly supported you but not target."
    },
    {
        "comment": "Sitting in Costco food court  wondeting why it's crowded on a Friday night...I think these are all former Target shoppers..."
    },
    {
        "comment": "Costco pizza for the win 🙌"
    },
    {
        "comment": "Hey Ann Kim why did you shut down your restaurants right after they voted to unionize and abandon a neighborhood you hitherto defended"
    },
    {
        "comment": "I wish they were at Costco"
    },
    {
        "comment": "Chef Kim, let us know where else we can support you. I do love Korean flavors, but I want to support companies that support POC all the time, not just when they feel it's convenient."
    },
    {
        "comment": "Such a shame. She probably put a lot of time and effort into these but unfortunately picked the wrong store. Call me when we get DEI back."
    },
    {
        "comment": "That’s crazy Costco pizzas are only $9.99"
    },
    {
        "comment": "You know who has good pizzas? @costco!"
    },
    {
        "comment": "Another day another post to remind me not to shop at Target."
    },
    {
        "comment": "Do they come with DEI??? Cause the costco ones do"
    },
    {
        "comment": "Variety pack? That would mean all types of bags are included and the bags are diverse. Looks like you’ll have to roll back on this product."
    },
    {
        "comment": "I’m sure Costco has these!"
    },
    {
        "comment": "Costco has them and they're cheaper and better quality."
    },
    {
        "comment": "How is everyone enjoying their Costco membership? ❤️"
    },
    {
        "comment": "So hard to scroll on Instagram while eating my Costco hot dog"
    },
    {
        "comment": "These comments slapping you around with a handful of baby powder!! 😂😂"
    },
    {
        "comment": "Isn't this too colorful for Target?"
    },
    {
        "comment": "I took my bag to Costco and spent it there."
    },
    {
        "comment": "Stopped supporting Target"
    },
    {
        "comment": "Costco has this!"
    },
    {
        "comment": "Adding sand which bags to my Costco cart now. My regular drawer will have to suffice to hold them until you bring back DEI."
    },
    {
        "comment": "Sorry. No time for a long comment on this post. My Costco pizza is almost ready."
    },
    {
        "comment": "If you don't want a diverse workplace, you don't deserve a diverse consumer base. ✊🏾"
    },
    {
        "comment": "Another day, not another dollar spent at target 💅"
    },
    {
        "comment": "Don’t miss target AT ALL. My $$ now goes to Costco and local businesses, preferably minority owned."
    },
    {
        "comment": "I used to shop at Target twice weekly. Haven’t been since January!"
    },
    {
        "comment": "I’m gone forever regardless if you reinstate DEI for monetary, selfish reasons! ✌🏾"
    },
    {
        "comment": "I just got my new DEI sheets from Costco today.. seriously I did. 🤗"
    },
    {
        "comment": "I was a long time Target customer. You really lost a lot of customers. Loyal customers. Your loss, Costco's gain."
    },
    {
        "comment": "Nope. Still not going. NO DEI / NO 🎯"
    },
    {
        "comment": "My new Costco membership is amazing"
    },
    {
        "comment": "Shop Costco!"
    },
    {
        "comment": "I now buy everything at the LOCAL UNION supermarket that I used to buy at Target.  Thanks, Stater Bros!"
    },
    {
        "comment": "This reminds me, I gotta make another Costco run!"
    },
    {
        "comment": "Kinda colorful for a Target store! Better check yourselves."
    },
    {
        "comment": "I LOVE COSTCO!!!! Thanks for sending me their way, Target!"
    },
    {
        "comment": "Bring back DEI"
    },
    {
        "comment": "This reminds me I need to make a Costco trip!"
    },
    {
        "comment": "Costco > Target"
    },
    {
        "comment": "Costco for the win #costco"
    },
    {
        "comment": "Costco for the WIN 🥇"
    },
    {
        "comment": "Love finding all of this stuff at costco"
    },
    {
        "comment": "Costco has these in bulk"
    },
    {
        "comment": "Stopped shopping from you! Meet me at Costco!"
    },
    {
        "comment": "What's Target? 😂"
    },
    {
        "comment": "I'm giving up @target for Lent, and I'm not even catholic 😎"
    },
    {
        "comment": "Guess what target. I just went to @costco BEST DECISION EVER 🤘🤘🤘"
    },
    {
        "comment": "@costco , do you all carry this product? I actually want it."
    },
    {
        "comment": "No DEI….. @costco gets my dollars 💵"
    },
    {
        "comment": "I'm a longtime shopper and red card holder. I will pay down my small balance this month and won't set foot in one of your stores again until you once again support human rights for all. This really hurts -- I love Target -- but you've very much made the wrong call."
    },
    {
        "comment": "Doing my shopping at Costco instead 💗"
    },
    {
        "comment": "The cool thing is there’s so many open spaces at the target parking lot, I parked there and go next-door to Costco⭐️"
    },
    {
        "comment": "Going to Costco, y’all need anything?"
    },
    {
        "comment": "These comments are so refreshing. So glad everyone isn’t spineless lol"
    },
    {
        "comment": "Target, you messed up. Do you know what DEI means? I'm going to close my account. I can't support a company that doesn't support me."
    },
    {
        "comment": "I loved target until you turned your back on Americans with your spineless switch away from dei. No more target for me."
    },
    {
        "comment": "Haven’t been able to support after you rolled back your DEI policy."
    },
    {
        "comment": "I'm so happy! I got my Costco card today!!!🔥"
    },
    {
        "comment": "Just remember they are still up 19% over the last 5 years, and 40% since 2018. Keep it up folks. They have to feel the pain harder!"
    },
    {
        "comment": "I abandoned Target and my circle card. Shopping at Costco now."
    },
    {
        "comment": "Spending all my DEI dollars at Costco."
    },
    {
        "comment": "nobody go to target this friday"
    },
    {
        "comment": "#COSTCO"
    },
    {
        "comment": "@target why did you abandon your DEI initiatives?"
    },
    {
        "comment": "You can get sandals and DEI at Costco."
    },
    {
        "comment": "But are the shoes comfortable for walking to Costco?"
    },
    {
        "comment": "These shoes are the same color as a Costco hotdog. I think I will head over to Costco and pick one up."
    },
    {
        "comment": "I don't know, are these shoes even cute? It's hard to tell with your anti-DEI veil."
    },
    {
        "comment": "Just got my first Costco membership. ❤️"
    },
    {
        "comment": "I love how Costco has DEI still!!"
    },
    {
        "comment": "I don’t even miss going to Target!!!"
    },
    {
        "comment": "Costco is a better experience!"
    },
    {
        "comment": "Not buying a pair until you grow a pair and stand up for DEI."
    },
    {
        "comment": "Gosh, we used to go to Target as a day out. Now it's not even an afterthought."
    },
    {
        "comment": "would look cute on my feet but I won’t step foot in a target store…wonder if they have them at Nordstrom Rack who supports DEI"
    },
    {
        "comment": "I just want you to know I've found a much better grocery store and I've moved on"
    },
    {
        "comment": "@target are you paying attention? #DEI really does matter to your customers."
    },
    {
        "comment": "@kohls has great spring styles too and they support DEI, win/win."
    },
    {
        "comment": "@target did you find your morals yet? We want DEI."
    },
    {
        "comment": "Old Navy is also staying committed to DEI (in case you can’t find the clothing you were looking for at Costco)"
    },
    {
        "comment": "Got a Costco membership"
    },
    {
        "comment": "Hey y’all…Old Navy supports DEI in case your looking for a clothing alternative to bootlicking Target store."
    },
    {
        "comment": "They also sell clothes at Costco"
    },
    {
        "comment": "nah I am taking a spring summer and winter break from Target racism"
    },
    {
        "comment": "Until you have DEI back; I won’t be going to any Target store."
    },
    {
        "comment": "When do you plan on reinstating your DEI program?"
    },
    {
        "comment": "I think you should find your DEI program again instead 😢"
    },
    {
        "comment": "I’m a personal shopper for large wealthy families. I used to spend 500$ per month per family at target. I now go out of my way to order from brands directly and use smaller grocery stores. Target is literally in walking distance from my house."
    },
    {
        "comment": "Nice outfit. I no longer choose you over Walmart. You're basically the same. #dei"
    },
    {
        "comment": "#costco has great selection"
    },
    {
        "comment": "Target can suck it😍"
    },
    {
        "comment": "Maybe take your coastal lewks and sail far away @target . We thought you were better. #dei"
    },
    {
        "comment": "Love u @costco yall should get some coastal looks in your store!"
    },
    {
        "comment": "I have bought all my groceries from target for the last 10 years. Since Jan 20 I haven’t spent a single cent, and not going back"
    },
    {
        "comment": "It says I’m a middle class white lady.  Turns out though, I’m a middle class white lady who likes DEI! ¯\\_(ツ)_/¯ Bring it back, Target!"
    },
    {
        "comment": "Costco has Topo Chico, Spendthrift, lacroix, Kirkland, flavored and plain Pellegrino."
    },
    {
        "comment": "Not buying anything here after the DEI announcement"
    },
    {
        "comment": "Costco has really good bubbly water"
    },
    {
        "comment": "Costco all day everyday"
    },
    {
        "comment": "Target's sparkling water flavor tastes like I'm going to Costco 💅"
    },
    {
        "comment": "No more 🎯 for us"
    },
    {
        "comment": "This is not aging well for you all huh. It’s February 21st and I haven’t been in a target in 2025. We definitely can live without it."
    },
    {
        "comment": "Restore DEI! Won’t shop at target until you do"
    },
    {
        "comment": "I will not shop at Target again until DEI is restored!"
    },
    {
        "comment": "@Costco all the way baby! Haven’t spent a single cent at target since you announced your policy changes."
    },
    {
        "comment": "Marketing towards women feels hollow after the DEI rollback"
    },
    {
        "comment": "Still ain’t going!!"
    },
    {
        "comment": "Good luck selling this to the Walmart crowd at Target prices. I’m spending my 💵💵 with those who support DEI. Way to lose what set you apart."
    },
    {
        "comment": "Can’t wait to NOT buy any of it! Bring back DEI!"
    },
    {
        "comment": "Nope"
    },
    {
        "comment": "This collection is 🔥"
    },
    {
        "comment": "put your DEI policies back in place"
    },
    {
        "comment": "I only go to Target to get my prescriptions from the CVS inside....."
    },
    {
        "comment": "Week #6 of skipping the target run."
    },
    {
        "comment": "Yea, I’m good. We already found somewhere new to shop."
    },
    {
        "comment": "Doesn’t Costco have all that?"
    },
    {
        "comment": "Who's still going strong on their no target runs ? 4 weeks for me ! 🙌🏻"
    },
    {
        "comment": "Target I loved you but it’s over between us. It’s not me, it’s you."
    },
    {
        "comment": "I'mma be honest... just came here to see all the comments and also adding I haven't been here in months 😂😂😂😂😂😂😂😂"
    },
    {
        "comment": "Just checking to make sure my once favorite store is still getting dragged. And whew. Carry on."
    },
    {
        "comment": "I haven't shopped at Target since they decided to embrace exclusion and intolerance."
    },
    {
        "comment": "Let’s bring back the DEI initiatives.  Then we can talk."
    },
    {
        "comment": "Did you guys see all the Costco deals this week? Killing it"
    },
    {
        "comment": "I successfully avoided target for a month, and didn’t even noticed 👏."
    },
    {
        "comment": "3 months with no 🎯"
    },
    {
        "comment": "39 days Target-free and counting."
    },
    {
        "comment": "Cute, but a big nope from me- not until @target has a DEI policy that supports all. This family of 5 big time Target shoppers have quit the store cold turkey"
    },
    {
        "comment": "Been a few weeks since I deleted the Target app and I’ve found some amazing things at @costco and @bi_mart_stores and @thecanbybooknook and @fredmeyerstores! Don’t miss it at all."
    },
    {
        "comment": "Made it a full month without shopping at target. 🫶🏾"
    },
    {
        "comment": "Can’t wait to get my Easter finds at Costco or literally any other place than here"
    },
    {
        "comment": "This made me want a Costco hotdog"
    },
    {
        "comment": "Good try running your Black History Month ad but what good is that without supporting DEI??? \"When someone shows you who they are,  believe them the first time.\" -Maya Angelou"
    },
    {
        "comment": "How many millions of dollars have you lost so far?"
    },
    {
        "comment": "The comments pass the vibe check 😌"
    },
    {
        "comment": "Hire a crisis manager. You’re not handing this well."
    },
    {
        "comment": "Those shoes are as flat as your DEI policies, no more Target for me."
    },
    {
        "comment": "definitely deleted my app and won’t ever shop at a Target again. smfh"
    },
    {
        "comment": "No DEI no more support. I love that all ethnicity are coming together on this"
    },
    {
        "comment": "Do you think you are going to ‘just wait this out’????? Joke’s on you…."
    },
    {
        "comment": "People are as diverse as shoes. No DEI / NO 🎯"
    },
    {
        "comment": "Nah I’m cool won’t be getting my coin ✊🏾"
    },
    {
        "comment": "Anywhere but @target.\n\nHappy to pay more, spend more time driving - whatever it takes, if it means being in community that reflects my values. Smaller and less popular grocery stores, Costco - they all have a better vibe compared to Target."
    },
    {
        "comment": "I have realize after a month , I don't need Target at all , and found all I need in other good stores . @target"
    },
    {
        "comment": "What is everyone buying at Costco this weekend?"
    },
    {
        "comment": "Shop at COSTCO instead!!!!"
    },
    {
        "comment": "Haven’t been in several weeks and I realized I didn’t need ya after all 😂🔥🙌"
    },
    {
        "comment": "I’m going to Costco. They have DEI."
    },
    {
        "comment": "Haven't shopped at Target for 25 days. Don't miss it. More fun and rewarding to find stores that are local and/or support DEI initiatives."
    },
    {
        "comment": "How’s that lack of DEI working out for you? Seems like a lot of us are opting for Costco."
    },
    {
        "comment": "Won’t shop here specifically because you dropped DEI."
    },
    {
        "comment": "So sad, I love Target but won't be shopping until you reinstate DEI"
    },
    {
        "comment": "Are you guys still trying to just act like this isn’t happening"
    },
    {
        "comment": "Not shopping at your stores until you reinstate DEI."
    },
    {
        "comment": "I’m sorry…who are y’all? I’m busy shopping at Costco."
    },
    {
        "comment": "I got a ton of groceries at Costco this past weekend!"
    },
    {
        "comment": "All you had to do was not be Walmart."
    },
    {
        "comment": "Costco has better strawberries"
    },
    {
        "comment": "Bring 👏 back 👏 your 👏 DEI 👏 policy."
    },
    {
        "comment": "Costco strawberries are far better"
    },
    {
        "comment": "Costco has a better selection and DEI"
    },
    {
        "comment": "You know, I really thought @target would listen to all the feedback, listen to their loyal customers, customers who have been shopping there for years. I really thought they valued our voices and would reverse course... in a few years when this administration is gone and we begin to pick up the pieces your silence and your complicity will be hard to forget... and YES, it is that serious!"
    },
    {
        "comment": "DEI policies, but make them reinstated."
    },
    {
        "comment": "Love this!"
    },
    {
        "comment": "No DEI, no Target shopping. Consumers do have a choice."
    },
    {
        "comment": "It’s sad that target is such an unethical corporation, I’m gonna miss shopping there!"
    },
    {
        "comment": "Switching to Costco made me realize how dispensable target really is"
    },
    {
        "comment": "Costco has better strawberries 🍓 ❤️"
    },
    {
        "comment": "I don’t even know why you bothered to fill your shelves 🤷🏽‍♀️. We are not coming."
    },
    {
        "comment": "No need to restock because we aren’t coming in 🥰"
    },
    {
        "comment": "haven’t been to target since yall rolled back DEI. used to go weekly"
    },
    {
        "comment": "Bring back DEI initiatives"
    },
    {
        "comment": "Nope. Buying none of it. Shame on you."
    },
    {
        "comment": "I used to come weekly and now I don’t. Went to Costco and I’m sticking with it!"
    },
    {
        "comment": "The first year Valentine's is Target free."
    },
    {
        "comment": "Just got my Costco card."
    },
    {
        "comment": "Nope. This is not the vibe."
    },
    {
        "comment": "The quality of your socials posts has really gone down. Maybe it’s the lack of DEI."
    },
    {
        "comment": "@target removed LGBTQ + Valentines Day cards. I’ll be taking our new baby shopping elsewhere"
    },
    {
        "comment": "Really missing shopping at Target. Did 80% of my household shopping for my family of 5 at your store for the entirety of my kids lives. However I value DEI and I’m willing to not shop at my favorite store until you reinstate your policies."
    },
    {
        "comment": "We'd love it if you would BRING BACK YOUR DEI POLICY."
    },
    {
        "comment": "I would love to purchase things again at Target however, I’m not going anywhere who doesn’t support DEI policies.  It’s sad that you guys thought this was a good idea, obviously y’all don’t know your customers.  A little hint, it’s not the side y’all chose!"
    },
    {
        "comment": "Thank you for reminding me to go to Costco 👌🏽"
    },
    {
        "comment": "I’ve found so many better places to shop since you ended your DEI. Just today I bought a board game from the maker- not at target!"
    },
    {
        "comment": "Deleting the app is a good way to prevent yourself going back to old habits!"
    },
    {
        "comment": "A real gift would be bringing back your DEI policy"
    },
    {
        "comment": "@target this is like when an ex shows up with a present…..no. It’s over."
    },
    {
        "comment": "Find your morals and bring back DEI @target"
    },
    {
        "comment": "Have spent zero dollars at target since the middle of January! 🙌"
    },
    {
        "comment": "Reinstating DEI would be the real “sprinkle of magic” that Target needs to get me to shop there again."
    },
    {
        "comment": "You brought back your DEI yet?? I’m waaaaaitiiiiing."
    },
    {
        "comment": "What did you think would happen? Legitimately curious. Costco is everywhere!"
    },
    {
        "comment": "Things that are essential: DEI"
    },
    {
        "comment": "Oh Target honey it’s not looking good for you"
    },
    {
        "comment": "I’ve literally spent thousands if not hundreds of thousands of dollars at your store and you wanna talk about you made something for us but can’t keep a program that was literally made for me OK target. 😂"
    },
    {
        "comment": "COSTCO🎯"
    },
    {
        "comment": "Bring back your DEI policies and I'll shop there again"
    },
    {
        "comment": "“We made good and gather/  up and up for you” but you decided to dismantle programs that benefited hundreds to thousands of customers. Until they are reinstated you can keep these products."
    },
    {
        "comment": "Thanks for taking back my returns! Until you treat people equally and stop relenting to insurrectionist-bullies, I will NOT be shopping with you."
    },
    {
        "comment": "What is everyone buying at @costco this weekend?"
    },
    {
        "comment": "So you want to PROFIT off black culture, but not invest in it. Got it."
    },
    {
        "comment": "I believe the word of the day is performative"
    },
    {
        "comment": "creator names i saw in the screenshot: \nRaven Gibson - founder of Legendary Rootz\nHadiya Williams — Black Pepper Paperie Co\nKenesha Sneed — Tactile Matter"
    },
    {
        "comment": "I’m celebrating Black History Month at Costco!"
    },
    {
        "comment": "Anyways, yall need anything from Costco?"
    },
    {
        "comment": "I feel bad for the black owned businesses that are exclusively sold in target. I hope you find the loophole in your contract."
    },
    {
        "comment": "I will be celebrating BHM but not at Target!"
    },
    {
        "comment": "And this is AFTER you deleted your previous “Black Beyond Measure” content. Now all of a sudden this is being posted? Ya’ll have lost it."
    },
    {
        "comment": "Did you think we forgot??? Babes it hasn’t even been a month."
    },
    {
        "comment": "TARGET. Fire your PR."
    },
    {
        "comment": "The comments pass the vibe check. Yall out here gaslighting as if you ain’t roll DEI Policies back."
    },
    {
        "comment": "“Your voice speaks volumes” mmmm but not at the target corporate office I guess? Lame performative attempt here"
    },
    {
        "comment": "what about your DEI program that you decided to stop using?"
    },
    {
        "comment": "@target be for real. You have a lot of nerve."
    },
    {
        "comment": "@target:  the audacity is ASTOUNDING."
    },
    {
        "comment": "I looooved going to target. I sometimes went multiple times a week. I stopped going when you announced the end of your DEI programs and I won't be back."
    },
    {
        "comment": "Hard pass. BRING BACK DEI!!!"
    },
    {
        "comment": "Going to Cotsco"
    },
    {
        "comment": "No thx. I prefer Costco ."
    },
    {
        "comment": "Biggest sellouts! Can’t wait to see you go bust."
    },
    {
        "comment": "Imagine not supporting DEI😂 #nevershoppinghereagain"
    },
    {
        "comment": "Ehh we rather Costco 💅🏼"
    },
    {
        "comment": "Bring back DEI & apologies. Then, maybe I will go back to the store."
    },
    {
        "comment": "This is still not what the people were asking for 😑"
    },
    {
        "comment": "You losing market value as a whole brings so much joy to my heart !!"
    },
    {
        "comment": "We going to @costco ✌🏾😤"
    },
    {
        "comment": "Why did you stop DEI programs?\nI can’t believe you, @target 😢"
    },
    {
        "comment": "@costco for the win!\n#nevertarget"
    },
    {
        "comment": "Roses are red, violets are blue, reputable companies invest in DEI programs, and Target should too."
    },
    {
        "comment": "This Valentine’s Day, we want a DEI policy ❤️"
    },
    {
        "comment": "After 40 years of regular Target shopping I’m finding I don’t  really miss it at all."
    },
    {
        "comment": "Haven’t shopped here in 2 weeks. Let’s make it 4 years. 😎"
    },
    {
        "comment": "Sorry Target we may forgive but we don’t forget, love without DEI is not really love at all"
    },
    {
        "comment": "Costco has better flowers anyway"
    },
    {
        "comment": "I came to check the comments and yikes! I honestly didn’t think it would be this bad - sorry, Target, but you did this to yourself 😢"
    },
    {
        "comment": "Nah~Signed the 92%"
    },
    {
        "comment": "Another day, not another dollar spent at Target 💅"
    },
    {
        "comment": "I broke up with you!"
    },
    {
        "comment": "Thanks got mine from @costco this year ❤️ I used to shop at Target weekly but haven’t been since you rolled back on DEI policies ❤️"
    },
    {
        "comment": "Thank goodness @costco had beautiful flowers for me to purchase this year.  Ya know, a bouquet of flowers is kinda like a group of people; it takes all kinds to make a beautiful, assorted arrangement that works well together."
    },
    {
        "comment": "Oooh, what lil treats am I going to get myself @costco today?!"
    },
    {
        "comment": "We’re still mad at you"
    },
    {
        "comment": "Not A DOLLAR 💵"
    },
    {
        "comment": "Target let the “I’m concerned what other people think of me” take over their “integrity to support people”"
    },
    {
        "comment": "I guess I’ll be buying in bulk at Costco and refilling my beauty stuff at Ulta ✌️"
    },
    {
        "comment": "Nope, I used to shop at target. Fav place, but no longer."
    },
    {
        "comment": "Deleted my account. White ally acting up in solidarity! 🎯"
    },
    {
        "comment": "Take notes from @costco"
    },
    {
        "comment": "Everything my family needs is @costco"
    },
    {
        "comment": "Do you offer the same for Palestinians ? Just asking for a friend..."
    },
    {
        "comment": "Parasitic business realises it should hide it's parasitic nature for a day or two."
    },
    {
        "comment": "You are doing a great job, thank you ❤️"
    },
    {
        "comment": "This would’ve been nice during hurricane Helene and Milton"
    },
    {
        "comment": "But they’re also not refunding people for bookings that are impacted by the fires. No amount of goodwill will coverup their misdeeds."
    },
    {
        "comment": "Why didn’t you offer this for the people of Appalachia after Helene?"
    },
    {
        "comment": "What about Helene? They did nothing."
    },
    {
        "comment": "How do I get a place ? I’m literally stuck with a toddler"
    },
    {
        "comment": "My parents and who lost their home in LA tried this but it didn’t work. Air bnb said they would get a call back but haven’t in 10 hours…"
    },
    {
        "comment": "Airbnb donates absolutely nothing."
    },
    {
        "comment": "I am on the site now  how do I get a place for the night"
    },
    {
        "comment": "Is @airbnb paying the hosts?"
    },
    {
        "comment": "@airbnb why weren't you there for the people in Florida and N. Carolina who are still homeless from Hurricane Milton?  Especially N. Carolina who could never have prepared for what happened."
    },
    {
        "comment": "Beautiful! Can people of any religious or political belief stay here?"
    },
    {
        "comment": "Wauw! Love it 😍"
    },
    {
        "comment": "Wow beautiful! The natural light is perfect 🌟"
    },
    {
        "comment": "Omg this would be amazing 😍"
    },
    {
        "comment": "But does it have WiFi? 🤔"
    },
    {
        "comment": "❤️ We stayed here!!! One hour from Boston!! @hiddenpinescabins"
    },
    {
        "comment": "You just joined Doge I will never use your service again"
    },
    {
        "comment": "Deleted my account!!!👎🏼"
    },
    {
        "comment": "Deleted account after 12 years and hundreds of stays. Inexcusable signing onto DOGE."
    },
    {
        "comment": "Never using AirBnB."
    },
    {
        "comment": "Joe Gebbia has joined musk in his attack on America and the rape of the US Treasury. Destroy Airbnb, save America."
    },
    {
        "comment": "You’re a part of DOGE…I’m gone."
    },
    {
        "comment": "Is it true that your CEO joined the DOGE team?"
    },
    {
        "comment": "Never using again :/"
    },
    {
        "comment": "Deactivated"
    },
    {
        "comment": "Bye bye @airbnb. It was fun but DOGE??? WTF?"
    },
    {
        "comment": "Is it ok if a host asks for My credit card Numbers? Help!!!"
    },
    {
        "comment": "We ❤️ this house 🐚"
    },
    {
        "comment": "Hosts donate their homes, Airbnb takes the credit.  Airbnb is not donating anything at all"
    },
    {
        "comment": "Why was I denied when I was in a level 3 evacuation zone???? Please help!"
    },
    {
        "comment": "Airbnb is taking the credit but not paying the hosts. STOP USING AIR BNBS"
    },
    {
        "comment": "Lets thank the hosts, not corporate moneymakers. Airbnb isn't footing the bill, just taking credit for hosts voluntarily letting people stay in they're houses cost-free"
    },
    {
        "comment": "Is it the hosts, or Airbnb? Usually the hosts volunteer their house without payment and Airbnb takes the credit."
    },
    {
        "comment": "Wonder if they could do this for the homeless - they need housing more than anyone else"
    },
    {
        "comment": "#shameonairbnb"
    },
    {
        "comment": "We love this place! 🙌"
    },
    {
        "comment": "@maineaframe is absolutely gorgeous 👏👏👏"
    },
    {
        "comment": "Hey I was just looking for a skyline view for air bnb for NYC for new years eve and I can't find any 🤔🤔💡"
    },
    {
        "comment": "Very cool 👏"
    },
    {
        "comment": "3rd world service at a premium price!"
    },
    {
        "comment": "8 days 17 calls and not a single response from Airbnb. Scammers"
    },
    {
        "comment": "Airbnb will be replaced soon. They DO NOT care about their hardworking hosts."
    },
    {
        "comment": "A company that provides assistance in finding housing cannot create such problems for its clients. It simply contradicts any logic."
    },
    {
        "comment": "Canceled by two host in one week and airbnb tells me too bad. Im spent 8k and find myself stranded in LA with ny kid waiting over 4 hours and counting for a call back.  They have no standards for their hosts"
    },
    {
        "comment": "Happy new year!"
    },
    {
        "comment": "<3 thanks for sharing my pictures"
    },
    {
        "comment": "A whole mood 🖤"
    },
    {
        "comment": "Hello, Italy!\n\nGreetings from San Antonio, Texas, USA!"
    },
    {
        "comment": "This is beautiful, it would be more beautiful if you put subtitles on the video."
    },
    {
        "comment": "Absolutely beautiful ❤️"
    },
    {
        "comment": "Such a heartwarming story!"
    },
    {
        "comment": "It appears I am being penalized for reporting discrimination while the individual who engaged in discriminatory behavior has been protected"
    },
    {
        "comment": "Do they charge you if you stay with these people? How will you survive?"
    },
    {
        "comment": "What’s the point of having a platform if you’ll just assume people will have parties and reject their reservations???"
    },
    {
        "comment": "Its lovely ❤️❤️❤️"
    },
    {
        "comment": "Do not rent anything on this platform, I made a rental, the host there charged me for a service he did not perform and the platform did nothing about it, and worse, they deleted my negative review!"
    },
    {
        "comment": "Bravo @susanwynnebailey 👏your kindness and generosity shine in everything you do 💫🤩"
    },
    {
        "comment": "Can you look the problem with the @carolaristides had here in Brazil ?"
    },
    {
        "comment": "Dreaming of a road trip with this destination ✨"
    },
    {
        "comment": "*immediately looks up Airbnbs in Brazil 🇧🇷"
    },
    {
        "comment": "One of our favorite cabins"
    },
    {
        "comment": "Looks like it grew from the forest ✨"
    },
    {
        "comment": "Looks like the ideal cabin!"
    },
    {
        "comment": "Very cool! Love their statement about valuing the ecosystem. We think the same!"
    },
    {
        "comment": "The pictures are nice, yes, but it’s a company that doesn’t solve problems when you face them."
    },
    {
        "comment": "We love a bonfire moment 🥰☕"
    },
    {
        "comment": "Cool build"
    },
    {
        "comment": "Looks like the bonfire is calling!"
    },
    {
        "comment": "Both pls ??"
    },
    {
        "comment": "Dreamy of spending the remaining of fall 2024 here! <3"
    },
    {
        "comment": "Love it!! Let’s feature @bigbearloghome 😍"
    },
    {
        "comment": "Wow beautiful goa"
    },
    {
        "comment": "Meri family aapki bohot bari fan he 😍"
    },
    {
        "comment": "need n clean"
    },
    {
        "comment": "Mam discount milega"
    },
    {
        "comment": "The magic of being “home” for the holidays!”🎅🎄✨✨✨"
    },
    {
        "comment": "This is ⭐️⭐️⭐️⭐️⭐️ marketing"
    },
    {
        "comment": "OMG! This is my favorite campaign ❤️❤️"
    },
    {
        "comment": "Happy holidays from Naples italy"
    },
    {
        "comment": "The best commercial I’ve ever seen in my life! ❤️"
    },
    {
        "comment": "I hope no children who are in emergency accommodation in a hotel see this advert. Santa is magic and will reach ALL children and their parents will do their best. I don’t like this."
    },
    {
        "comment": "Happy Holidays from Joshua Tree! 🤍🌵🎄"
    },
    {
        "comment": "Happy Holidays! 😍😍"
    },
    {
        "comment": "Happy holidays from Armenia 🎅🌲🎄🛷🇦🇲"
    },
    {
        "comment": "who animated this!! It’s amazing"
    },
    {
        "comment": "Winter dream! Yes 👏"
    },
    {
        "comment": "I need help ASAP! I am being left stranded by your host?"
    },
    {
        "comment": "Tiny is the best ❤️"
    },
    {
        "comment": "Sleek, futuristic compact design."
    },
    {
        "comment": "Thanks for sharing 🥰"
    },
    {
        "comment": "You’re cooked boys, corruption can’t be sustained when the American people are starving"
    },
    {
        "comment": "Just deleted your app and my account. Your values are absolutely disgusting. I wouldn’t give you my money for anything."
    },
    {
        "comment": "Cannot believe you would go work for DOGE!!!!????? 😭😡☹"
    },
    {
        "comment": "Air bnbs on film 🙌"
    },
    {
        "comment": "Sponsored by the Kay.KayKay"
    },
    {
        "comment": "Account deleted ☺️☺️☺️☺️☺️"
    },
    {
        "comment": "The Shiff delivering the goods 💕 @shiffmanator"
    },
    {
        "comment": "Marketing intern need a raise"
    },
    {
        "comment": "Marketing team knew wtf they were doing with this one. W."
    },
    {
        "comment": "his rent was due"
    },
    {
        "comment": "this will go crazy with nothin like youuu"
    },
    {
        "comment": "Finally bro a good collab"
    },
    {
        "comment": "Off it🤍"
    },
    {
        "comment": "Love to see it Braulio!!"
    },
    {
        "comment": "track id?"
    },
    {
        "comment": "Heavy mate 🔥"
    },
    {
        "comment": "OMG! Congrats, Bráulio! The paintings look great! I'd love to see them with my own eyes!"
    },
    {
        "comment": "Love it so much!😍"
    },
    {
        "comment": "e30 on bbs’ wrapped in Azenis 🔥"
    },
    {
        "comment": "The vibes 🙌😍"
    },
    {
        "comment": "So the first one ain’t nettspend"
    },
    {
        "comment": "Uh the e30 with bbs on them 😫"
    },
    {
        "comment": "Can we collaborate with some art work on tshirts? I’m from East Los Angeles, native from Boyle Heights."
    },
    {
        "comment": "Those pants 👏🏾👏🏾"
    },
    {
        "comment": "Topppp I hope this collection arrives in Brazil soon."
    },
    {
        "comment": "This outfit omg"
    },
    {
        "comment": "Who’s in charge of your design team? Im wondering because the designs lately are not it 95$ for slapped on tribal print? I’m just curious is all🧍🏽‍♂️"
    },
    {
        "comment": "Please can you make a steel/composite toe version 🙏🏽😌🥰"
    },
    {
        "comment": "Yo when the purple and black gonna drop they not on the website"
    },
    {
        "comment": "\"Artistry and self reflection\",Vans in a nutshell"
    },
    {
        "comment": "Love the socks 😍❤️"
    },
    {
        "comment": "Old cool Vans 🔥🔥🔥"
    },
    {
        "comment": "..Lil Sims is a legend"
    },
    {
        "comment": "I REALLY wish you guys would start putting the sizes of the models on the website for clothing"
    },
    {
        "comment": "Love a good classic 🙌"
    },
    {
        "comment": "Need the purple ones!🔥"
    },
    {
        "comment": "Love!!! 😍 When is the next collab? 🥹"
    },
    {
        "comment": "Who even is this?"
    },
    {
        "comment": "plz bring back the stackform knu skoolz 🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼"
    },
    {
        "comment": "@milk_eyewear proud of you guys ❤️‍🔥❤️‍🔥❤️‍🔥"
    },
    {
        "comment": "So amazing!!!! Probably an epic trip!!! Ramp looks so awesome!!!"
    },
    {
        "comment": "This trip was a dream! Grateful for every moment. 💕🛹"
    },
    {
        "comment": "I feel so fortunate to have been part of this incredible trip, thank you @vans @lizziearmanto and @imillaskate las amo hermanas! ❤💫🛹"
    },
    {
        "comment": "😍 nothing short of amazing, all of you!! 💕🔥"
    },
    {
        "comment": "Love this 🙌🔥🔥"
    },
    {
        "comment": "Suck great photos beautiful girls skating 👏🏻👍😀❤️"
    },
    {
        "comment": "Siii sooo proud of these women and grateful to vans for empowering women around the world!! Gracias 🙏🏽✨🛹💜🇧🇴"
    },
    {
        "comment": "That last picture is legendary."
    },
    {
        "comment": "Keep seeing more and more about these girls. Very much here for it 🇧🇴💜"
    },
    {
        "comment": "Yaaa @lizziearmanto and @imillaskate crew, this rules!! Amazing photos @lapir0 🙌"
    },
    {
        "comment": "restore the kaboom from jinx 😭😭"
    },
    {
        "comment": "Got mine today and posted a new reel of what i got❤️❤️"
    },
    {
        "comment": "How long is this deal"
    },
    {
        "comment": "Besties! Is the cream formula still leaking? Please advise. ❤️"
    },
    {
        "comment": "Is this only for today"
    },
    {
        "comment": "They were stocked out 😭 eho can relate"
    },
    {
        "comment": "Lemme hit the store before they close! 🏃🏽‍♀️🛒🛍️"
    },
    {
        "comment": "Yup need a few"
    },
    {
        "comment": "I tried purchasing one today and I was told, only certain shades were available for the deal. Disappointed 😔"
    },
    {
        "comment": "Weird way of proposing but yes 💖"
    },
    {
        "comment": "Wow looks amazing 🔥"
    },
    {
        "comment": "Love it"
    },
    {
        "comment": "The sponge applicator! I’ll never go back to a small one ever again. Bigger is better! 🔥🔥🔥"
    },
    {
        "comment": "Love this product 😍!!"
    },
    {
        "comment": "The match stix’s are so untouchable 😍 one of my favorite product, so creamy and blends out like a dream! Suedish is such a perfect contour shade I’m obsessed 🥰"
    },
    {
        "comment": "😍😍😍 Love it, yes!"
    },
    {
        "comment": "Please restock the Arcane collection! 💙"
    },
    {
        "comment": "I love using these for contour! They blend so well, and they are versatile ❤️"
    },
    {
        "comment": "Arcane restock when?"
    },
    {
        "comment": "I need this one ❤️"
    },
    {
        "comment": "Love the colors 🤎"
    },
    {
        "comment": "Gimme some of that lavender heat 🔥🔥"
    },
    {
        "comment": "Be a rapper with your new album.😂"
    },
    {
        "comment": "OMG MOMM I LOVEE YOUU 🥹🩷"
    },
    {
        "comment": "Her hair grows so fast"
    },
    {
        "comment": "I love this woman🥹🥹❤️‍🔥"
    },
    {
        "comment": "Want it all"
    },
    {
        "comment": "Yasssss I got my Lavendar Savage today"
    },
    {
        "comment": "I’ve never felt more seen these are way up my alley 😍😍"
    },
    {
        "comment": "Time to collect every single shade 😂❤️"
    },
    {
        "comment": "You should add a disclaimer people need to wear shades to watch this video 😎🤩✨ blinding 🥰"
    },
    {
        "comment": "🍀🌍🙏🏿♥️🙏🏻💯LIVE LONG QUEEN JOYCE BRIDGIANA AND MÌLANTE THEIR ALL OVER 100  PRAY THEY STAY STRONG AND HEALTHY AND RAISE IT IN A MEGA HALLELUJAH COMING FROM NORTHERN IRELAND"
    },
    {
        "comment": "Owww how much I love this brand 😍😍❤️❤️"
    },
    {
        "comment": "you’re posting a lot about gloss bomb creams at the minute… does these mean new shades are (finally) pending??? 👀"
    },
    {
        "comment": "Ugh my heart 😭 these are too pretty😍"
    },
    {
        "comment": "Lavendar Savage is my fav glossbomb and I own them all 🔥🔥🔥🔥 , RiRi did it again! 💕💕💕"
    },
    {
        "comment": "😍I have almost the whole line of Fenty glosses 😂 ❤️❤️❤️ except for “KABOOM” 🥹💔 NEED A RESTOCK!!! @fentybeauty 🖤🖤🖤🖤"
    },
    {
        "comment": "Can kaboom & rebel RAIS’R from arcane enter the villa 😢"
    },
    {
        "comment": "The Arcane glosses need to join❤️"
    },
    {
        "comment": "🗣️ today’s the day y’all!!!!"
    },
    {
        "comment": "Gimme all the shades! 🔥❤️🔥"
    },
    {
        "comment": "Need this pink in my life 💕💕"
    },
    {
        "comment": "I actually want Pink Dragonfly I’m like saving my last few swipes for my wedding in 30 years"
    },
    {
        "comment": "No, we wanted the Arcane collection back.."
    },
    {
        "comment": "Can we also get the Cheeky Gloss Bomb back? That beautiful orange shimmer is needed for the summer 🧡✨"
    },
    {
        "comment": "yall are bringing back everything but the arcane collection 😭"
    },
    {
        "comment": "Soooo beautiful, Yesterday my post was for you, i dream that you love❤️❤️❤️❤️❤️❤️"
    },
    {
        "comment": "Finally! My favourite shade! 😍💜"
    },
    {
        "comment": "Bring back diamond milk pleaseeeee"
    },
    {
        "comment": "Omg you guys 😍 my dreams come true!!!! Yaassss I love this shade so much"
    },
    {
        "comment": "y'all did this for me.  YALL DID THIS FOR ME OMG."
    },
    {
        "comment": "@riotgames @arcaneshow @fentybeauty hi team could we please get a full restock on the arcane x fentybeauty collection ! thanku <3"
    },
    {
        "comment": "That’s me!"
    },
    {
        "comment": "Wise words from a wise woman @badgalriri ❤️‍🔥"
    },
    {
        "comment": "What’s cool about these new models is nothing,"
    },
    {
        "comment": "Stellantis we just want Toyota reliability and the old XJ body styles. It’s not complicated."
    },
    {
        "comment": "Best vehicles at the show! ✌️💙"
    },
    {
        "comment": "Ruining my brand. Stellantis, move aside."
    },
    {
        "comment": "Please no more electrics, it’s basically against Jeep life.  Diesel Wrangler!!!"
    },
    {
        "comment": "Drove the Wagoneer S when we got one at our store. Thing is absolutely nuts"
    },
    {
        "comment": "Average time on lot. 386 days 😂"
    },
    {
        "comment": "I own a wagoneer s, drive it before ya hate it. 600hp suv with massaging seats yes please"
    },
    {
        "comment": "@jeep redesign anything you want but please stop changing the iconic grill 😣"
    },
    {
        "comment": "I was robbed by the dealership Fiori Jeep, I filed a complaint with SAC under number 1450.8908 and never heard back. JEEP does not provide an Ombudsman. It is explained why its concessionaire representatives feel comfortable acting outside the laws  Fui roubado pela concessionária\nFiori Jeep, realizei uma queixa no SAC sob número 1450.8908 e nunca tive retorno. A JEEP Não disponibiliza Ouvidoria. Tá explicado porque os seus representantes concessionários se sentem à vontade de agir marginais às leis .\n@jeep"
    },
    {
        "comment": "For once Jeep shines some light on the best thing they and AMC ever made. Long live the XJ."
    },
    {
        "comment": "What if we get limited retro line up with the xj, mj, and yj brong the square light trio back"
    },
    {
        "comment": "Wish yall would go back to building good jeeps again, the only 2 jeeps I’ve owned that haven’t had tons of problems were my 98 grand Cherokee, had over 300,000 miles with very little issues and my 1995 YJ that’s lifted and had very little issues with it"
    },
    {
        "comment": "#bringbacktheXJ"
    },
    {
        "comment": "Can't wait to see a 2027 XJ...that's true to the square!"
    },
    {
        "comment": "This is like my Jeep Cherokee Sport from 1998. mine is in a green/blue metallic colour and I love it 😍"
    },
    {
        "comment": "Need to bring that back -  have no idea why this is so difficult"
    },
    {
        "comment": "95! Man I miss my 88"
    },
    {
        "comment": "in sand hollow😍"
    },
    {
        "comment": "Anyone who guessed 2001 needs to focus a little less on their bath toy obsession"
    },
    {
        "comment": "1995, the first model year that a driver's side airbag became standard on the XJ Cherokee."
    },
    {
        "comment": "I love my 01 limited. The XJ needs to make a comeback along with the 4.0"
    },
    {
        "comment": "Will always be my favorite Jeep Model, second place: Gladiator ❤️OlllllllO❤️"
    },
    {
        "comment": "Should I come with as your passenger princess? (I have snacks!)"
    },
    {
        "comment": "i’m going to buy a jeep rn because of this"
    },
    {
        "comment": "🔥🔥literally the coolest person everrr"
    },
    {
        "comment": "This is so cool!!!"
    },
    {
        "comment": "Omg yass!! This is epic, you are an epic!! So proud and happy for you big sister 🤩♥️🤗"
    },
    {
        "comment": "The unknown is our favorite part—can’t wait to go exploring with you 🙌"
    },
    {
        "comment": "Jeeps >>"
    },
    {
        "comment": "Congratulations 🎉🍾"
    },
    {
        "comment": "Guess we have to get ads inside of our cars now though 👎🏼👎🏼👎🏼 wont be buying"
    },
    {
        "comment": "Ready or not ur gonna make it happen 💪💪"
    },
    {
        "comment": "Thank you for adding me to the group of amazing jeephers!🩵"
    },
    {
        "comment": "Love this so very much! To all the incredible ladies! Happy International Women’s Day! ❤️"
    },
    {
        "comment": "Happy International Women's Day to all of the Jeep ladies out there! ✌️💗"
    },
    {
        "comment": "🔥🔥🔥amazing jeeps with amazing people! Happy International Women’s Day Everyone"
    },
    {
        "comment": "LOVE this!! It’s the Freedom!"
    },
    {
        "comment": "Yess! Wonderful line-up of amazing ladies ❤️"
    },
    {
        "comment": "Happy International Women's Day, Queens!👸🏼👸🏽👸🏻👸🏿"
    },
    {
        "comment": "I spy me and the pups 💛"
    },
    {
        "comment": "🔥🔥🔥 love this"
    },
    {
        "comment": "Happy International Women’s day 💐💐💐"
    },
    {
        "comment": "Let yourself self celebrate Jeep-Girl’s and -Lady’s and all the rest of women’s in the full world 🎉🎉🎉🍀🍀🍀💐💐💐🙏🙏👍👍👍. Happy International Woman’s Day 🩵🩵🩵🍀🍀🍀🩵🩵🩵"
    },
    {
        "comment": "Everyone starts small 😂😂😂"
    },
    {
        "comment": "Never had a toy jeep as a kid. But I got the real one now and loving it ❤️🔥"
    },
    {
        "comment": "Ok now I have to find my childhood jeep photo! 😍"
    },
    {
        "comment": "This could be a great small ad campaign. So many 90s babies had mini jeeps as \"first\" cars and now they're at the age of buying real cars. Great insight!!!"
    },
    {
        "comment": "I wanted a power wheels Jeep so bad as a kid. Now I have a big one, but I still want a power wheels one! 😂"
    },
    {
        "comment": "Such a. Beauty 💙"
    },
    {
        "comment": "Dang… I was hoping for gladiator with 392 😭"
    },
    {
        "comment": "I have a 2022 jeep wrangler 4xe and it has been in the dealership for recalls and other mechanical issues more than I have taken off roading 😭 I regret trading in my regular gas jeep 😭"
    },
    {
        "comment": "after being on the fence on a 4xe for years, I LOVE mine 🫶🏽"
    },
    {
        "comment": "Really? Ads on the screen at stops? Pshhhh"
    },
    {
        "comment": "Not with 20” wheels you’re not"
    },
    {
        "comment": "Is it true yall showing ads in your cars?"
    },
    {
        "comment": "Would never buy from this company. Good luck with the ads."
    },
    {
        "comment": "I think Im going to wait for 2028."
    },
    {
        "comment": "20 inch wheels on a back country/off-road trim ain’t it…"
    },
    {
        "comment": "20” wheels with 32” tires for the backcountry? I’d rather take the 16” wheel and 32” tire into the backcountry (like the ones that come standard on the bottom rung sport model)."
    },
    {
        "comment": "I want content like this 🔥👏"
    },
    {
        "comment": "That’s the same color as mine!!!💙"
    },
    {
        "comment": "Waoooo😍 new FAVORITE color😍💙"
    },
    {
        "comment": "Can you do a jeep @mcboatcompany crossover and have interior floors seating dash look like an xstar please"
    },
    {
        "comment": "hey... I wrote to support 2 times, but never got an answer, what's going on? 🤔 Will I ever get an answer?"
    },
    {
        "comment": "I’m excited to be a part of this! I can’t wait to see what questions my AI gets asked 🍷"
    },
    {
        "comment": "Congratulations on the launch! So excited to be a part of On Call and be on speed dial for everyone ❤️❤️XK"
    },
    {
        "comment": "Can’t wait to be part of this. Just don’t ask me your cooking questions!"
    },
    {
        "comment": "Brilliant spot! Bit crazy though how recognisable his voice has become. Love the motivational speech at the end💪🏻"
    },
    {
        "comment": "Excited to join the MasterClass On Call lineup! Thanks to @MasterClass for including me (and my new sleep AI)—minus any detours into soufflé-making (Gordon has you covered)!"
    },
    {
        "comment": "This is 🔥🔥🔥🔥"
    },
    {
        "comment": "More access to your favorite @masterclass instructors…? Yes, please! #bydhttmwfi"
    },
    {
        "comment": "So proud to be part of the @masterclass family. They are wonderful collaborators (and people!) and everything they do is first-rate. I’m looking forward to exploring On Call as an instructor and as a student."
    },
    {
        "comment": "Really cool AI feature @masterclass! I’m a subscriber and big 🙌 of @masterclass - would be cool to feature 🤺 fencing or wellness classes by 🇺🇸 Paris Olympian @mitchellsaron!"
    },
    {
        "comment": "I feel your pain Brother. And this is a question your historic cinema career on film raises. Why is he seldom overlooked as a ‘first-take’ great actor for blockbuster films, and rarely recognized during award season. Except when Denzel did that one special moment?"
    },
    {
        "comment": "The Magic of Menopause is not just a class; it's a way to break down the barriers for women to feel seen, supported, and less alone during one of the most transformative times of their lives! Thank you, @masterclass @halleberry @drjudithjoseph @drloribritto @drjengunter @bowers_whi"
    },
    {
        "comment": "We learned so much from @bowers_wbhi, @drjudithjoseph, @drloribrotto, @drjengunter led by @halleberry! 💗 Excited this class and such important information is now available!"
    },
    {
        "comment": "Just saw the ad for this and came RUNNING over to say congrats!!"
    },
    {
        "comment": "I can’t wait to watch and share with my clients!!"
    },
    {
        "comment": "So glad this is being talked about!!"
    },
    {
        "comment": "Very excited to share this with everyone!"
    },
    {
        "comment": "So great!!♥️♥️"
    },
    {
        "comment": "I love to see this! At 56, I'm feeling better, however 53, was hard for me. I felt alone in trying to get advice on menopause. Finally, following a holistic doctor's advice and women on IG helped me. I'm happy to see more conversations are being had 😍"
    },
    {
        "comment": "Thank you @halleberry and @masterclass for this opportunity to have the conversation of a lifetime ❤️"
    },
    {
        "comment": "So excited to provide this info alongside @halleberry with @masterclass so that people are empowered and better prepared for menopause and perimenopause ❤️💪🏾"
    },
    {
        "comment": "Why does this little preview bring a tear to my eye? I’m just in awe of her. She’s phenomenal and inspiring."
    },
    {
        "comment": "You’ll always be one of my favorite writers 🖤"
    },
    {
        "comment": "Love Mindy ❤️"
    },
    {
        "comment": "I love your grit & your hustle— you are such an inspiration, Mindy Kaling! & you write the funniest shows!!!"
    },
    {
        "comment": "This is awesome Mindy!! ❤️"
    },
    {
        "comment": "Mindy project forever my jam 🔥"
    },
    {
        "comment": "I can finally become her mentee now 😭❤️"
    },
    {
        "comment": "Yassss my gurl 💙💙💙"
    },
    {
        "comment": "The preparation, strategy and knowledge definitely worked, since I have watched The Mindy Project approximately 10 times, all seasons 🙂 #MyFavoriteShow"
    },
    {
        "comment": "I am perimenopausal and I keep hearing about how hard it is and how empowering . I just don't see the empowerment part. Please help us more ."
    },
    {
        "comment": "Such a beautiful woman and what a character she played in the movie « Monster’s ball », one of the best movies I have seen , the choice of a woman is not always easy (..)"
    },
    {
        "comment": "Hormone Balancing Supplements, exercise, and clean living is the key"
    },
    {
        "comment": "I loved it ! Watched last night"
    },
    {
        "comment": "Zero f*ks to give. I love it ❤️"
    },
    {
        "comment": "It’s a no from me utter Bs😢"
    },
    {
        "comment": "IT LOOKS GREAT ON YOU 👑🤍😍🙌🏽"
    },
    {
        "comment": "Full blown menopausal and nothing dry here. Please understand that every woman experience with perimenopause and menopause is different. Even then I can’t find anything nice about either or 😂💁🏾"
    },
    {
        "comment": "It's not true even.."
    },
    {
        "comment": "Kudos to HB for endorsing this! Keep on."
    },
    {
        "comment": "Freaking out just by the description. We need solutions on how to battle these damn symptons 😢"
    },
    {
        "comment": "is there a difference between your wife and Marty Short?"
    },
    {
        "comment": "Your the best"
    },
    {
        "comment": "No Steve it’s just everybody trying to be nice to you"
    },
    {
        "comment": "Love this"
    },
    {
        "comment": "People don’t want to think anymore. The bare minimum is too much, apparently."
    },
    {
        "comment": "This feels very forced and fake. Just be you, someone's going to resonate."
    },
    {
        "comment": "Well.. here’s a sign that masterclass invites anyone. It’s now like Ted talks. Anyone can do it. Too bad."
    },
    {
        "comment": "They are hiding something, their hands 😂"
    },
    {
        "comment": "I do whatever I wanna do foreal, I’m a nice guy and my hands be in my pockets sometimes. Sue me"
    },
    {
        "comment": "who made the rules"
    },
    {
        "comment": "Says the famous Drag Queen.......😐"
    },
    {
        "comment": "Thanks for sharing"
    },
    {
        "comment": "Love Ru but this is complete and utter nonsense"
    },
    {
        "comment": "I think some men put their hands in their pockets so they cannot be accused of something when taking photos."
    },
    {
        "comment": "They are hiding how uncomfortable they are 😮"
    },
    {
        "comment": "This ain't 1925. Wgaf? 🤦🏽‍♂️"
    },
    {
        "comment": "Oh dear if anyone takes this person seriously,  we are in big trouble!"
    },
    {
        "comment": "The last thing I would honestly care is, if people think of me something just because I like to put my hands in the pockets 😀. \nLike if this creature will come up to me and say something about it, I would just laugh in his (or her? Not so sure nowadays) face."
    },
    {
        "comment": "that was a woman?.."
    },
    {
        "comment": "She’s behind some of the GREATEST hits!"
    },
    {
        "comment": "Seriously the best documentary I have EVER seen!!!!"
    },
    {
        "comment": "Stoked to watch this!"
    },
    {
        "comment": "I love the energy"
    },
    {
        "comment": "Such an amazing writer 💛"
    },
    {
        "comment": "First Master class I started and finished in one sitting❤️ I loved it!!!"
    },
    {
        "comment": "Ha! Love the authenticity! This is great."
    },
    {
        "comment": "She is a beautiful Soul❤️🌹"
    },
    {
        "comment": "Love her whole personality and talent!"
    },
    {
        "comment": "Diane Warren: Relentless. Now streaming on MasterClass"
    },
    {
        "comment": "Begging for an acting Masterclass from Aunjanue Ellis-Taylor 🙏🏻🙏🏻🙏🏻 just watched her in Nickel Boys, and my. god."
    },
    {
        "comment": "Song lyrics are terrible anyways - have you heard any new songs with great lyrics? I haven’t in a long time."
    },
    {
        "comment": "Creative Direction + Casting: @jtc.jpeg\nStyling: @jtc.jpeg\nLighting Assists: @ossynine, @dishawnlaflare & @honcho.jpg\nModel: @kaitothekingdom"
    },
    {
        "comment": "The iso chill and heatgear line are awesome during the summer."
    },
    {
        "comment": "Glass id please👏👏"
    },
    {
        "comment": "You guys doing 40% off for vets again soon?"
    },
    {
        "comment": "Why do you put the Logo on the side of the neck instead of in front? There is no way to see the logo if you have a collared shirt over it! Please change this design!"
    },
    {
        "comment": "@kaitothekingdom 😍😍😍"
    },
    {
        "comment": "This is huge 🔥"
    },
    {
        "comment": "Go Neph!!! I loving it!!!🔥"
    },
    {
        "comment": "Great moves"
    },
    {
        "comment": "Omg is that @haad.0"
    },
    {
        "comment": "Creative Direction + Casting: @jtc.jpeg\nStyling: @jtc.jpeg\nLighting Assists: @ossynine, @dishawnlaflare & @honcho.jpg\nModel: @triszyk"
    },
    {
        "comment": "Cold🥶"
    },
    {
        "comment": "I like how the caption is “skis up” and you put a snow board after the caption"
    },
    {
        "comment": "my Croatian queen 😍 😍😍"
    },
    {
        "comment": "Tunel fits Will be Crazy ❤️❤️❤️❤️"
    },
    {
        "comment": "wtf is this"
    },
    {
        "comment": "Abs for days 😂"
    },
    {
        "comment": "Love this. Congrats my guy. 👏"
    },
    {
        "comment": "Need This’ 😍😍"
    },
    {
        "comment": "@gholdaway2 @igr.william WHAT DID I SAY PEOPLE SHOULD MAKE OMDS I NEEDDDDD"
    },
    {
        "comment": "Lookin’ fresh and clean 👏"
    },
    {
        "comment": "So tough 🔥"
    },
    {
        "comment": "Gotta love the Under armour Brand!!!!!!❤️❤️"
    },
    {
        "comment": "Lost in the moment🐧"
    },
    {
        "comment": "This is the best news I could have gotten in 2025"
    },
    {
        "comment": "Please respond in dm"
    },
    {
        "comment": "I have been waiting for my refund for two months and customer service has not responded to me.its a shame!!!!"
    },
    {
        "comment": "Thankfully ❤️❤️❤️"
    },
    {
        "comment": "My favorite baseball player from a Philly girl! So happy I could style these for the e-commerce website 🤍 ⚾️"
    },
    {
        "comment": "yall really gotta let me help design!"
    },
    {
        "comment": "Do you have any signature for Soto?"
    },
    {
        "comment": "My god she aged beautifully"
    },
    {
        "comment": "Holy shit - I never realized the age difference… fully seated for this"
    },
    {
        "comment": "I will never forget watching this unfold. Ultimately, she was called a slut and he continued to be called President. Just despicable, tragic and unfair. She deserved better. \n\nLooking forward to hearing her speak!"
    },
    {
        "comment": "She knew Bill was married . . ."
    },
    {
        "comment": "You’re giving Barbara Walters with this one"
    },
    {
        "comment": "I’ve said it once and I’ll say it again, the devil works hard but Alex Cooper works harder 😍"
    },
    {
        "comment": "Why doesn’t she take responsibility, though? She wasn’t blamed for her sexuality - it was her infidelity. C’mon."
    },
    {
        "comment": "Okay first, she looks amazing 🙌 Secondly, I cannot freaking wait. And third, I wish this was the biggest scandal coming out of the White House now 😩"
    },
    {
        "comment": "Omg she’s still talking about this? lol was this her highlight of her life idk 🤷🏽‍♀️ I don’t like that! Highlighting and reliving someone’s affair over and over again omg"
    },
    {
        "comment": "Awesome choice for an interview, Alex! She was a kid back then. And when she said she lost her future I said aloud yeah you did. Being sexually harassed in the workplace and losing business or livelihood because of it is a real thing and men for the most part don’t get it. She looks great"
    },
    {
        "comment": "Monica Lewinsky they could never make me hate you"
    },
    {
        "comment": "This is huge"
    },
    {
        "comment": "father casually breaking the internet on a tuesday evening !"
    },
    {
        "comment": "Did he ever try to make it right???"
    },
    {
        "comment": "That’s an amazing question actually"
    },
    {
        "comment": "I need to know if she voted for Hillary Clinton"
    },
    {
        "comment": "I can not wait to go on my girl walk and listen to this episode today"
    },
    {
        "comment": "I can't get over the women here still vilifying her."
    },
    {
        "comment": "Monica is a true class act ❤️"
    },
    {
        "comment": "It was a witch hunt"
    },
    {
        "comment": "I have to remember how young she was because she looks younger now than then. She looks incredible. 22 is so young, not excusing anything but I can see how manipulated she could have been at that age."
    },
    {
        "comment": "It is so sad to me that this woman is 51 years old and still talking about this. Needing the money so badly that she will solidify it as her only noteworthy contribution."
    },
    {
        "comment": "Umm “Linda” was NOT a girls girl 🙅‍♀️"
    },
    {
        "comment": "She was 22 years old! I’m blown away that she was that young. I was a kid back then and the tabloids in the 90’s were so brutal and toxic. I’m so glad she got through it and lil mama looks amazing!"
    },
    {
        "comment": "I miss Bill Clinton type of problems. Those were the good ol’ days. \nBut jokes aside - she was a click bait for that administration. They completely ravaged her soul and reputation. It’s good to see that somehow, she managed to come through with dignity. And that she has the opportunity to say her peace."
    },
    {
        "comment": "The toxic abuse of a power dynamic is appalling. I don’t know how that wasn’t the center of the story."
    },
    {
        "comment": "Queens. 👑👑. As a 50 something woman looking back what we had to watch with Monica and Anita Hill…navigating workplaces and trying to improve the landscape for our children…I’m soooo proud that Alex has this podcast and that I finally get to tell Monica that there were A LOT of us who cared and knew you were a great person who was being used to get the Republicans back in power. Monica you are phenomenal. Keep slaying ladies. XOXO"
    },
    {
        "comment": "@monica_lewinsky was 22 and Clinton was 51. He was in a position of power and she was a subordinate, yet he was admired, and she was vilified.  I can’t imagine what she went through, but I admire her strength."
    },
    {
        "comment": "She was 22?!?!!!!! We should have been much gentler to her."
    },
    {
        "comment": "“I never should have fucking been in that position” 👏👏👏👏"
    },
    {
        "comment": "Now that I’m a 40 year old woman, thinking about how she went through all that at 22 is just mind boggling. 😢"
    },
    {
        "comment": "She knew better but chose otherwise"
    },
    {
        "comment": "being 22 now i cannot even fathom going through that, we owe miss girl an apology expeditiously."
    },
    {
        "comment": "Not a victim and not a hero. Adults make their own decisions."
    },
    {
        "comment": "22, so she was an adult"
    },
    {
        "comment": "No one will EVER make me feel sorry for Monica..yall are tripping."
    },
    {
        "comment": "So good to hear you talking about power imbalance. Normalize this please."
    },
    {
        "comment": "I feel bad for Monica, but can we discuss how the Clinton's got a huge pass on this situation?  I remember being a young woman at the time and thinking 'I can't belive Hillary didn't leave him over this'. How naieve of me."
    },
    {
        "comment": "I call bullshit!! At 22 you should be smart enough mature enough to make well informed decisions."
    },
    {
        "comment": "What the documentary….she knew what she was doing"
    },
    {
        "comment": "She was an adult. Sh3 knew what she was doing. She knew he was married.  She cannot keep playing the victim cars."
    },
    {
        "comment": "Understand power dynamics- he was married where were her morals?"
    },
    {
        "comment": "She’s lost alot of weight….good for her👍"
    },
    {
        "comment": "This is actually the perfect proposal"
    },
    {
        "comment": "She looks amazing and I need to know what her lip combo is immediately"
    },
    {
        "comment": "To do it in private then have all your people waiting for you when you get there is next level. 🔥"
    },
    {
        "comment": "Girl!! The ring is next level stunning!! Eeeeeep 🤗 congratulations!!!"
    },
    {
        "comment": "Every Jamaican girlie’s fav place is Turks, including myself"
    },
    {
        "comment": "Thata boy Kuz! Welcome to the Milwaukee family Winnie!"
    },
    {
        "comment": "Omg this is so sweet and intentional 😍❤️"
    },
    {
        "comment": "Ok but also can we evolve past acting like a “blinding” ring is any kind of measure of anything other than wealth/privilege? It feels so archaic hearing ppl compliment or brag about the size of someone’s blood diamond when this is supposed to be a celebration of love, not capitalism. I’m not even so woke—I’m just not materialistic and living in the 50’s"
    },
    {
        "comment": "I need @gabby.windey on this pod!"
    },
    {
        "comment": "How mad that we have to be excited about a man doing what they said they were gonna do tho! 😅"
    },
    {
        "comment": "\"He was welcoming me to the Puma family\". \"But I didn't see it\". \"So I DM'd him saying thank you\""
    },
    {
        "comment": "Nice episode! Really enjoyed the flow of the conversation"
    },
    {
        "comment": "A man of his word 🙌🏽"
    },
    {
        "comment": "Losing brain cells listening to this"
    },
    {
        "comment": "What’s with that face?"
    },
    {
        "comment": "Now that’s applying pressure"
    },
    {
        "comment": "Awww, this is lovely 😍"
    },
    {
        "comment": "To get a call back makes him a man of his word? What ?! Lol"
    },
    {
        "comment": "CHD just elevated to a whole different level after this interview 🔥"
    },
    {
        "comment": "Putting myself in her shoes…can you imagine being a young woman, 24 years old (frontal lobes not even developed) in a situation with the “most powerful man in the world” a man of amazing power giving me attention. \nPeople can judge all they want but they weren’t in that position…(literally and figuratively)"
    },
    {
        "comment": "No mention of Monica being sorry to his wife????"
    },
    {
        "comment": "Love Monica so much.  What a freaking warrior legend."
    },
    {
        "comment": "No way! Is that Monica Lewinsky?! She looks incredible!"
    },
    {
        "comment": "Smh. That's what happens when u fool around with a married man. The truth will eventually come out."
    },
    {
        "comment": "Whoa, Limewire throwback"
    },
    {
        "comment": "loved this episode"
    },
    {
        "comment": "Did he force her to have sexual relations? Or does she just go for married dudes?"
    },
    {
        "comment": "I had no idea she was only 24 when this happened! How sad"
    },
    {
        "comment": "Omg nothing like digging up things from 30 years ago. Move forward already"
    },
    {
        "comment": "You don’t get more iconic than this 🙌"
    },
    {
        "comment": "Laws need to change. There shouldn’t be a statutory bar on sexual harassment cases. Most states say a woman has 1-3 years to file suit from the moment of the alleged harassment. Monica said something so compelling. That it took her years to process her trauma. Think of the thousands of woman who are afraid to come forward and when the time comes where they feel healed enough to, legally they are too late. Our government has and continues to fail sexual harassment victims."
    },
    {
        "comment": "We need more!!\nI feel like we are just hearing the beginning of everything she has to share ❤️"
    },
    {
        "comment": "@callherdaddy - great interview!!"
    },
    {
        "comment": "I actually really felt like I got to know more about her. Love this!"
    },
    {
        "comment": "AN HOUR? WHO has the time😂"
    },
    {
        "comment": "She’s awesome"
    },
    {
        "comment": "Love her. Love the answers ❤️"
    },
    {
        "comment": "“Where” 👀🔥😂"
    },
    {
        "comment": "I'm so unhip I don't even know who the hell this is"
    },
    {
        "comment": "I need more interviews with @winnieharlow"
    },
    {
        "comment": "It’s Winnie Harlow ❤️"
    },
    {
        "comment": "Yall. That’s Winnie’s hand and ring 😂 stop saying Selena"
    },
    {
        "comment": "Oh that’s Winnie!!!!!"
    },
    {
        "comment": "okay actorrr 👏🏾"
    },
    {
        "comment": "Alex I got scared amazing acting 10/10"
    },
    {
        "comment": "Oh wait a minute Alexandra… it’s giving actress purrrr 💅🏾"
    },
    {
        "comment": "This is gold!"
    },
    {
        "comment": "Cast Alex in a movie right now"
    },
    {
        "comment": "Tyra is that you??? 🫣👏🎬"
    },
    {
        "comment": "Screaming!!! Love this and loved the Winnie interview!! So happy to see her thriving ♥️♥️♥️"
    },
    {
        "comment": "Bill Clinton should change his name"
    },
    {
        "comment": "She looks happy and at peace ❤️"
    },
    {
        "comment": "i don’t think that ppl in the comments understand what abuse of power means."
    },
    {
        "comment": "Man they crucified her, if that would have happened now… different story and she could have at least been heard. So sad."
    },
    {
        "comment": "She was a young girl with a powerful man, and listening to her here, she has become a strong woman who knows who she is."
    },
    {
        "comment": "As someone who’s 44, and was 18ish when this news broke, I remember it vividly. She was smeared EVERYWHERE. For years. Long before social media, this was forced in all of our faces. That she was the bad guy and he was ‘perfect.’ My heart aches for her and I wish there were visuals of how terrible the headlines were. It’s so hard to explain how it was back then. Thank you Alex. You NAILED this. I’m so grateful the daddy gang got to hear this rich history of where we all came from"
    },
    {
        "comment": "So glad this is being talked about.  I feel similarly about women having to own the responsibility of changing our names back the case of divorce. A mutual relationship didn’t work out and now it’s on the woman to announce it publicly and go through the time, effort and emotional stress to start over."
    },
    {
        "comment": "She looks amazing 🔥"
    },
    {
        "comment": "Sooooo glad she was on the show. She is 1 strong band ass woman!! She went through HELL and it’s so nice to see her thriving!!! Good on her!! 👏🏻👏🏻👏🏻"
    },
    {
        "comment": "This is your most 🔥guest"
    },
    {
        "comment": "I feel so bad for her. I remember how the media smeared her and blamed her for everything. I would like to believe if this happened now the man aka the president of the most powerful country in the world would be held accountable to for abuse of power, manipulation etc. it’s nice to see she’s doing well now and speaking out. Wishing her success and true happiness."
    },
    {
        "comment": "Never listened to your podcast but was so intrigued by this one and now have been listening all day! I get why you’re so applauded and excited to hear @monica_lewinsky podcast next!"
    },
    {
        "comment": "I just finished this interview! Fantastic questions @alexandracooper and such a fabulous interview, SO we'll done @monica_lewinsky ! I'm so proud of how you've handled your difficult journey and have come out the other side taking back your power and leading by example.  Best wishes for success on your new podcast 👏👑👏"
    },
    {
        "comment": "Wowowow!! @cdawn_whiting I’m 54. This was so refreshing! 🙌❤️ \nMay I say what a new light this should shed on your new endeavors.\nThis has made be emotional, and motivate me in such a Positive way! I have testimony on Also being involved with a married man at 21.\nWell done ladies"
    }
]